[
  {
    "title": "India-Pakistan conflict: 'We need to stand united'",
    "text": "'We need to stand united' amid India-Pakistan conflict\n\n2 days ago Share Save Share Save\n\nRana Basharat Ali Khan The International Human Rights Movement held an multi-faith meeting in Bristol where leaders called for unity\n\nCommunity leaders have called for people to stand united as tensions escalate between India and Pakistan following reported military strikes between the two countries. On Wednesday, Indian forces launched \"Operation Sindoor\" targeting sites in Pakistan and Pakistan-administered Kashmir, in retaliation for a deadly militant attack in Indian-administered Kashmir that killed at least 26 people on 22 April. Pakistan denies involvement, but Indian authorities allege attackers included Pakistani nationals. In the west of England, the impact of the conflict is reverberating on families who are fielding anxious WhatsApp calls. Local leaders are also stepping forward to offer guidance and solidarity.\n\nThere is growing concern, not only for relatives overseas, but also over the risk of tensions disrupting the unity between communities in the region. Bristol Green Party councillor Abdul Malik, who recently returned from his ancestral village in Azad Jammu and Kashmir, said the escalation tension has \"caused a lot of grief\". After Wednesday's strikes in Pakistan, a gathering was held at Easton's Jamia Mosque. \"It's so important to give a sense of security to the elders who've lived most of their lives in the UK but still feel so connected to what happens abroad,\" said Mr Malik. \"This isn't a war about religion. This is a political war about borders. We must not bring hatred to our streets and our homes. \"Bristol has a wonderful Indian and Pakistani community. We've sat together. We've listened. This is the time to stand united - and that's what we intend to do.\"\n\nAbdul Malik A gathering was held at the Easton Jamia Mosque on Wednesday afternoon\n\n\"Trying to avoid any conflicts is my main concern,\" said Pankaj Pandya, one of the trustees of the Hindu Temple in Bristol. \"Hopefully it doesn't escalate, and it doesn't become tit-for-tat leading to an outright war between two nuclear nations. \"Being an Indian myself, it's a concern for not only what is happening between India and Pakistan, but just generally the issues of war throughout the world at the moment.\"\n\nLocal leaders in the west of England are also are urging communities not to spread misinformation online. \"There's a lot of fake information and false news being spread around which doesn't help the situation,\" said Atiff Ghafar, vice chair of the Swindon Pakistan Association. \"So, we have been telling and encouraging our communities not to share unverified news reports.\" Pakistan says 36 people have been killed by Indian air strikes and firing. India says at least 16 people were killed by Pakistani shelling on its side of the de facto border. \"As someone from the Pakistani diaspora, it's quite sad to see that there's tensions between both communities and innocent lives have been lost on both sides of the border,\" said Mr Ghafar. \"We don't want anything to be spreading across to this part of the world as we have very good cordial and friendly relationships with our Indian diaspora community who have lived with us side by side for a good 50 to 60 years.\"\n\nOn 29 April, an interfaith and intercultural meeting was organised in Bristol by the International Human Rights Movement (HRM), Bristol Pakistani Forum and the Bristol Multi-Faith forum. Rana Basharat Ali Khan, chairman of the HRM, said: \"It's so horrible to witness something like this in the 21st Century. \"It is not something we want to witness in this age, while we are fighting for justice. \"We need to change our priorities - we need to focus and invest on humans rather than defence and we need to come off this war affected mentality.\"\n\nIndian-administered Kashmir has seen a decades-long insurgency which has claimed thousands of lives. Kashmir is claimed in full by India and Pakistan but administered only in part by each since they were partitioned following independence from Britain in 1947. The countries have fought two wars over the area. Following the 22 April attack in Pahalgam, Indian-administered Kashmir, a Hindu prayer vigil was held on 27 April at the Hindu Garden of Peace in Gloucester to remember the victims of the deadly attack. Speaking to the BBC Radio Gloucestershire at the vigil, Manish Jani said: \"It is something horrific against humanity, not just against one country.\" Hema Patel echoed those emotions: \"Many people were killed, including Christians and Muslims. This is not about condemning any religion; we just pray for peace.\" Dr Ashok and Dr Pravin Patel, co-chairs of the Hindu Cultural Association, both emphasised unity and empathy over division. \"The first religion is humanity,\" said Dr Pravin. \"Any heinous act by one human on another is a blot on humanity.\"\n\nAtiff Ghfar Atiff Ghafar, vice chair of the Swindon Pakistan Association, is encouraging communities to maintain peace\n\nThe Indian government says its forces have launched \"Operation Sindoor\", \"hitting terrorist infrastructure\" in Pakistan and Pakistan-administered Kashmir \"from where terrorist attacks against India have been planned and directed\". In a statement, the Indian government said that \"nine sites have been targeted\". \"Our actions have been focused, measured and non-escalatory in nature. No Pakistani military facilities have been targeted. India has demonstrated considerable restraint in selection of targets and method of execution.\" The statement adds that the attack was ordered after last month's deadly militant attack on tourists in India-administered Kashmir.",
    "url": "https://www.bbc.com/news/articles/cx202gvxgj7o"
  },
  {
    "title": "Kashmir: What's the way out of the India and Pakistan crisis?",
    "text": "How can India and Pakistan find a way to de-escalate?\n\n2 days ago Share Save Anbarasan Ethirajan South Asia Regional Editor Share Save\n\nAFP via Getty Images Anti-India protests took place in Pakistan's capital, Islamabad, on Friday\n\nAs the continuing India-Pakistan crisis takes a dangerous turn, nations around the world are urging calm. The initial thinking was that after India launched air strikes, and with Pakistan claiming to have shot down several Indian jets - a claim Delhi has not confirmed - both sides could claim \"victory\" and de-escalate. But there's a danger that any protracted tit-for-tat attacks could lead them to a far more damaging prospect. During past conflicts, such as in 2019 and 2016, it was the United States and a few other global powers that put pressure on Delhi and Islamabad to bring the situation under control and de-escalate.\n\nNow passions are running high and the nationalist rhetoric has reached a crescendo on both sides. The neighbours are closer to war than in recent decades. Kashmir: Why India and Pakistan fight over it\n\nWhat we know about India's strikes on Pakistan and Pakistan-administered Kashmir “The World community is keeping quiet; that’s dangerous,” Ayesha Siddiqa, a Pakistani academic who is a senior fellow at King’s College London. “Though the flare up has been happening for decades, this is the first time the two countries find themselves in a conflict without anyone monitoring them or forcefully telling them to stop,” she said. Unless Washington gets more involved, Islamabad and Delhi may continue with their accusations and counter-accusations. Although US Secretary of State Marco Rubio has been telling the senior leaders of India and Pakistan to de-escalate, the message from other American leaders is different. US Vice-President JD Vance has said that a potential war between India and Pakistan would be \"none of our business\" during an interview with Fox News. \"We want this thing to de-escalate as quickly as possible. We can't control these countries, though,\" Vance said. Vance was on a visit to India when the militant attack in Indian-administered Kashmir, which killed 26 civilians, took place. US President Donald Trump had earlier called rising tension between India and Pakistan a \"shame\".\n\nAFP via Getty Images Local residents stand beside the wreckage of their home that was damaged amid Pakistani artillery shelling\n\nDuring previous India-Pakistan skirmishes, for example in 2019, tension was defused quickly after India carried out what it called “surgical strikes” on what it called terrorist camps inside Pakistan. One Indian military jet was shot down in the aftermath of the crisis and the pilot was captured by Pakistan. He was released two days later after reported intervention from Washington and other world powers. But the intensity of the current conflict is different and passions are running high on both sides. While the Trump administration’s priorities are more about tariffs, China and Ukraine-Russia, it may require a concerted attempt by the international community to lower tension between the two nuclear-armed rivals. The other world power which has a stake in South Asia is China. Beijing has close economic and military ties with Islamabad. It has invested more than $50bn (£37.5bn) in Pakistan as parts of its China-Pakistan Economic Corridor to boost trade. China also has unresolved border issues with India and the two countries recently had a border clash in the Himalayan region 2020. Despite the tension, China is the second largest trading partner of India. \"If the US is uninterested [in resolving India-Pakistan tension] then other permanent members of the UN Security Council – P5 - should get involved. It is their responsibility as well,\" Shen Dingli, a Shanghai-based international affairs expert tells the BBC. As India accuses Pakistan of supporting the Kashmiri separatist rebels, who carried out the deadly attack on tourists last month, the Chinese academic says \"the P-5 members can launch a credible investigation into the incident\", to address India's concerns.\n\nWatch: Aftermath of strikes in Pakistan-administered Kashmir\n\nGulf states like Qatar, Saudi Arabia and the United Arab Emirates, which have close ties to both the countries, could step up their mediation efforts. Saudi Arabian Minister of State for Foreign Affairs Adel Al-Jubeir arrived in Delhi on 7 May in what was seen as a surprise visit amid the backdrop of a spike in tensions between India and Pakistan. “A good meeting with Adel Al-Jubeir,\" Indian Foreign Minister Subrahmanyam Jaishankar said, adding that his counterpart “shared India’s perspective on firmly countering terrorism”. The Saudi minister arrived in Islamabad on Friday for talks with Pakistan's leaders. There are an estimated 2.6 million Pakistanis living and working in the Gulf Kingdom. Riyadh has considerable influence in Pakistan. Saudi Arabia has loaned billions of dollars to Pakistan to bail out the country during economic crises over the years. One way out of the current crisis could be a situation where both sides can claim victory to satisfy their audience. Delhi says the missile strikes on suspected militant hideouts inside Pakistan and Pakistan-administered Kashmir were part of a commitment to hold “accountable” those responsible for the last month’s attack in Pahalgam. “India has already said it has achieved its objectives. Now, the ball is in Pakistan’s court. If they wish to retaliate then that would elicit a strong response from India,” retired Indian Lt Gen D S Hooda said. For Pakistan, especially for its powerful military, it would want to show its people that it can stand up against India and teach it a lesson once again by downing five of the Indian air force jets during a dog fight. India has not acknowledged the loss of any of its fighter jets in the current skirmish. But according to Pakistani academic Siddiqa, how the current crisis ends depends on what India’s stated objectives are. “India’s goal posts keep changing day by day – from punishing Pakistan to attaining something more,” she said.",
    "url": "https://www.bbc.com/news/articles/clyzg8ygeezo"
  },
  {
    "title": "India and Pakistan: The first drone war between nuclear-armed neighbours",
    "text": "The first drone war opens a new chapter in India-Pakistan conflict\n\n2 days ago Share Save Soutik Biswas • @soutikBBC India correspondent Share Save\n\nNurPhoto via Getty Images An Indian soldier operates a surveillance drone amid heightened tensions in Jammu and Kashmir\n\nThe world's first drone war between nuclear-armed neighbours has erupted in South Asia. On Thursday, India accused Pakistan of launching waves of drones and missiles at three military bases in Indian territory and Indian-administered Kashmir - an allegation Islamabad swiftly denied. Pakistan claimed it had shot down 25 Indian drones in recent hours. Delhi remained publicly silent. Experts say the tit-for-tat attacks mark a dangerous new phase in the decades-old rivalry, as both sides exchange not just artillery but unmanned weapons across a volatile border. As Washington and other global powers urge restraint, the region is teetering on the edge of escalation, with drones - silent, remote and deniable - opening a new chapter in the India-Pakistan conflict. \"The Indo-Pak conflict is moving into a new drone era - one where 'invisible eyes' and unmanned precision may determine escalation or restraint. Thus, in South Asia's contested skies, the side that masters drone warfare won't just see the battlefield - they'll shape it,\" Jahara Matisek, a professor at the US Naval War College, told the BBC.\n\nSince Wednesday morning, Pakistan says Indian air strikes and cross-border fire have killed 36 people and injured 57 more in Pakistan and Pakistan-administered Kashmir. On the other side, India's army reports at least 16 civilians dead from Pakistani shelling. India insists its missile barrage was retaliation for a deadly militant attack on Indian tourists in Pahalgam last month - an attack Islamabad denies any role in. Pakistan's military announced on Thursday that it had shot down 25 Indian drones across various cities, including Karachi, Lahore and Rawalpindi. The drones - reportedly Israeli-made Harop drones - were reportedly intercepted using both technical and weapon-based countermeasures. India claimed to have neutralised several Pakistani air defence radars and systems, including one in Lahore, which Islamabad denied.\n\nGetty Images Remnants of an Indian drone strike being inspected in Karachi on Thursday\n\nLaser-guided missiles and bombs, drones and unmanned aerial vehicles (UAVs) have become pivotal in modern warfare, significantly enhancing the precision and efficiency of military operations. These can relay co-ordinates for airstrikes or, if equipped, directly laser-designate targets, and help immediate engagement. Drones can be used as decoys or suppression of enemy air defences, flying into contested airspace to trigger enemy radar emissions, which can then be targeted by other munitions like loitering drones or anti-radiation missiles. \"This is how Ukraine and Russia both do it in their war. This dual role - targeting and triggering - makes drones a force multiplier in degrading enemy air defences without risking manned aircraft,\" says Prof Matisek. Experts say India's drone fleet is largely built around Israeli-made reconnaissance UAVs like the IAI Searcher and Heron, along with Harpy and Harop loitering munitions - drones that double as missiles, capable of autonomous reconnaissance and precision strikes. The Harop, in particular, signals a shift toward high-value, precision-targeted warfare, reflecting the growing importance of loitering munitions in modern conflict, experts say. The Heron, say experts, is India's \"high-altitude eyes in the sky\" for both peacetime monitoring and combat operations. The IAI Searcher Mk II is designed for frontline operations, offering up to 18 hours of endurance, a range of 300km (186 miles), and a service ceiling of 7,000m (23,000ft). While many believe India's combat drone numbers remain \"modest\", a recent $4bn deal to acquire 31 MQ-9B Predator drones - which can can fly for 40 hours and up to an altitude of 40,000ft - from the US marks a major leap in its strike capabilities. India is also developing swarm drone tactics - deploying large numbers of smaller UAVs to overwhelm and saturate air defences, allowing higher-value assets to penetrate, say experts. Pakistan's drone fleet is \"extensive and diverse\", comprising both indigenous and imported systems, Ejaz Haider, a Lahore-based defence analyst told the BBC. He said the inventory includes \"over a thousand drones\", featuring models from China, Turkey and domestic manufacturers. Notable platforms include the Chinese CH-4, the Turkish Bayraktar Akinci, and Pakistan's own Burraq and Shahpar drones. Additionally, Pakistan has developed loitering munitions, enhancing its strike capabilities.\n\nAnadolu via Getty Images Security forces inspect area after an Indian drone strike on Karachi on Thursday\n\nMr Haider said the Pakistan Air Force (PAF) has been actively integrating unmanned systems into its operations for nearly a decade. A key focus is the development of \"loyal wingman\" drones - unmanned aerial vehicles designed to operate in co-ordination with manned aircraft, he added. Prof Matisek believes \"Israel's technical assistance, supplying Harop and Heron drones, has been pivotal for India, while Pakistan's reliance on Turkish and Chinese platforms highlights an ongoing arms race\". While the recent drone exchanges between India and Pakistan mark a significant escalation in their rivalry, they differ markedly from the drone-centric warfare observed in the Russia-Ukraine conflict, experts say. There, drones become central to military operations, with both sides deploying thousands of UAVs for surveillance, targeting and direct attacks. \"Deploying drones [in the ongoing conflict] instead of fighter jets or heavy missiles represents a lower-level military option. Drones are less heavily armed than manned aircraft, so in one sense, this is a restrained move. However, if this is merely a prelude to a broader aerial campaign, the calculus changes entirely,\" Manoj Joshi, an Indian defence analyst, told the BBC. Ejaz Haider believes the recent drone activity in Jammu \"appears to be a tactical response to immediate provocations, not a full-scale retaliation [by Pakistan]\". \"A true retaliatory strike against India would involve shock and awe. It would likely be more comprehensive, involving multiple platforms - both manned and unmanned - and targeting a broader range of objectives. Such an operation would aim to deliver a decisive impact, signalling a significant escalation beyond the current tit-for-tat exchanges,\" Mr Haider says.\n\nGetty Images Indian Army personnel secure missile debris discovered in Amritsar's border villages",
    "url": "https://www.bbc.com/news/articles/cwy6w6507wqo"
  },
  {
    "title": "India-Pakistan relations",
    "text": "Kashmir: Why India and Pakistan fight over it\n\nThey fought two wars over it and are nuclear armed - but what's at the root of the dispute?",
    "url": "https://www.bbc.com/news/topics/cx3ezqn30pmt"
  },
  {
    "title": "India and Pakistan: How backchannels and US mediators pulled rivals back from the brink",
    "text": "How backchannels and US mediators pulled India and Pakistan back from the brink\n\n1 hour ago Share Save Soutik Biswas and Vikas Pandey BBC News Reporting from Delhi Share Save\n\nReuters Crowds gathered in Islamabad after the ceasefire announcement\n\nIn a dramatic turn of events, US President Donald Trump took to social media on Saturday to announce that India and Pakistan - after four tense days of cross-border clashes - had agreed to a \"full and immediate ceasefire\". Behind the scenes, US mediators, alongside diplomatic backchannels and regional players, proved critical in pulling the nuclear-armed rivals back from the brink, experts say. However, hours after a ceasefire deal, India and Pakistan were trading accusations of fresh violations - underscoring its fragility. India accused Pakistan of \"repeated violations\" while Pakistan insisted it remained committed to the ceasefire, with its forces showing \"responsibility and restraint.\" Before Trump's ceasefire announcement, India and Pakistan were spiralling towards what many feared could become a full-blown conflict. After a deadly militant attack killed 26 tourists in Indian-administered Kashmir last month, India launched airstrikes inside Pakistan and Pakistan-administered Kashmir - triggering days of aerial clashes, artillery duels and, by Saturday morning, accusations from both sides of missile strikes on each other's airbases. The rhetoric escalated sharply, with each country claiming to have inflicted heavy damage while foiling the other's attacks.\n\nGetty Images US Secretary of State Marco Rubio (left) and President Donald Trump\n\nTanvi Madan, a senior fellow at the Brookings Institution in Washington DC, says US Secretary of State Marco Rubio's call to Pakistani Army Chief Asim Munir on 9 May \"might have been the crucial point\". \"There's still much we don't know about the roles of various international actors, but it's clear over the past three days that at least three countries were working to de-escalate - the US, of course, but also the UK and Saudi Arabia,\" she says. Pakistan's Foreign Minister Ishaq Dar told Pakistani media that \"three dozen countries\" were involved in the diplomacy - including Turkey, Saudi Arabia and the US. \"One question is whether, if this call had come earlier - right after the initial Indian strikes, when Pakistan was already claiming some Indian losses and an off-ramp was available - it might have prevented further escalation,\" Ms Madan says. This isn't the first time US mediation has helped defuse an India–Pakistan crisis. In his memoir, former US secretary of state Mike Pompeo claimed he was woken up to speak with an unnamed \"Indian counterpart\", who feared Pakistan was preparing nuclear weapons during the 2019 standoff.\n\nReuters Kashmiri men greeted each other after the ceasefire announcement in Srinagar\n\nFormer Indian High Commissioner to Pakistan Ajay Bisaria later wrote that Pompeo overstated both the risk of nuclear escalation and the US role in calming the conflict. But diplomats say there is little doubt the US played an important role in defusing the crisis this time. \"The US was the most prominent external player. Last time, Pompeo claimed they averted nuclear war. While they'll likely exaggerate, they may have played the primary diplomatic role, perhaps amplifying Delhi's positions in Islamabad,\" Mr Bisaria told the BBC on Saturday. Yet at the outset, the US appeared strikingly standoffish. As tensions flared, US Vice President JD Vance said on Thursday that the US was not going to get involved in a war that's \"fundamentally none of our business\". \"We can't control these countries though. Fundamentally, India has its gripes with Pakistan... America can't tell the Indians to lay down their arms. We can't tell the Pakistanis to lay down their arms. And so we're going to continue to pursue this thing through diplomatic channels, \" he said in a television interview. Meanwhile, President Trump said earlier this week: \"I know both [leaders of India and Pakistan] very well, and I want to see them work it out... I want to see them stop, and hopefully they can stop now\".\n\nGetty Images Pakistani people celebrated after the ceasefire between Pakistan and India, in Hyderabad, Sindh province\n\nEjaz Haider, a Lahore-based defence analyst, told the BBC this appeared to be the only difference from previous occasions. \"The American role was a continuation of past patterns, but with one key difference - this time, they initially stayed hands-off, watching the crisis unfold instead of jumping in right away. Only when they saw how it was playing out did they step in to manage it,\" Mr Haider told the BBC. Experts in Pakistan say as the escalation cycle deepened, Pakistan sent \"dual signals\", retaliating militarily while announcing a National Command Authority (NCA) meeting - a clear reminder of the nuclear overhang. The NCA controls and takes operational decisions regarding Pakistan's nuclear weapons. This was around the time US Secretary of State Marco Rubio stepped in. \"The US was indispensable. This outcome would not have occurred without Secretary Rubio's efforts,\" Ashley J Tellis, a senior fellow at the Carnegie Endowment for International Peace, told the BBC. What also helped was Washington's deepening ties with Delhi.",
    "url": "https://www.bbc.com/news/articles/clyn617xv4no"
  },
  {
    "title": "What we know about India's strikes on Pakistan and Pakistan-administered Kashmir",
    "text": "What we know about India's strikes on Pakistan and Pakistan-administered Kashmir\n\n4 days ago Share Save Flora Drury BBC News Share Save\n\nAFP via Getty Images People inspect a damaged mosque following India's strikes in Muzaffarabad in Pakistan-administered Kashmir\n\nTwo weeks after a deadly militant attack on tourists in Indian-administered Kashmir, India has launched a series of strikes on sites in Pakistan and Pakistan-administered Kashmir. The Indian defence ministry said the strikes - named \"Operation Sindoor\" - were part of a \"commitment\" to hold \"accountable\" those responsible for the 22 April attack in Pahalgam, Indian-administered Kashmir, which left 25 Indians and one Nepali national dead. But Pakistan, which has denied any involvement in that attack, described the strikes as \"unprovoked\", with Prime Minister Shehbaz Sharif saying the \"heinous act of aggression will not go unpunished\". Sharif on Wednesday said the Pahalgam attack \"wasn't related\" to Pakistan, and that his country was \"accused for the wrong\" reasons.\n\nWatch: Aftermath of strikes in Pakistan-administered Kashmir\n\nPakistan's military said at least 31 people were killed and 57 injured in the strikes on Tuesday night. India's army said at least 15 civilians were killed and 43 injured by Pakistani shelling on its side of the de facto border. Pakistan's military says it shot down five Indian aircraft and a drone. India has yet to respond to these claims. Late on Wednesday, Sharif said the air force made its defence - which was a \"reply from our side to them\".\n\nWhere did India hit?\n\nDelhi said in the early hours of Wednesday morning that nine different locations had been targeted in both Pakistan-administered Kashmir and Pakistan. It said these sites were \"terrorist infrastructure\" - places where attacks were \"planned and directed\". It emphasised that it had not hit any Pakistani military facilities, saying its \"actions have been focused, measured and non-escalatory in nature\". In the initial aftermath of the attacks, Pakistan said three different areas were hit: Muzaffarabad and Kotli in Pakistan-administered Kashmir, and Bahawalpur in the Pakistani province of Punjab. Pakistan's military spokesperson, Lt Gen Ahmed Sharif, later said six locations had been hit. Pakistan's Defence Minister Khawaja Asif told GeoTV in the early hours of Wednesday that the strikes hit civilian areas, adding that India's claim of \"targeting terrorist camps\" was false.\n\nWhy did India launch the attack?\n\nThe strikes come after weeks of rising tension between the nuclear-armed neighbours over the shootings in the picturesque resort town of Pahalgam. The 22 April attack by a group of militants saw 26 people killed, with survivors saying the militants were singling out Hindu men. It was the worst attack on civilians in the region in two decades, and the first major attack on civilians since India revoked Article 370, which gave Kashmir semi-autonomous status, in 2019. Following the decision, the region saw protests but also witnessed militancy wane and a huge increase in the number of tourists. The killings have sparked widespread anger in India, with Prime Minister Narendra Modi saying the country would hunt the suspects \"till the ends of the Earth\" and that those who planned and carried it out \"will be punished beyond their imagination\". However, India initially did not name any group it believed was behind the attack in Pahalgam. But Indian police alleged that two of the attackers were Pakistani nationals, with Delhi accusing Pakistan of supporting militants - a charge Islamabad denies. It says it has nothing to do with the 22 April attacks. On 7 May, Indian Foreign Secretary Vikram Misri said Pakistan-based Lashkar-e-Taiba militant group carried out the attack. In the two weeks since, both sides had taken tit-for-tat measures against each other - including expelling diplomats, suspending visas and closing border crossings. But many expected it would escalate to some sort of cross-border strike - as seen after the Pulwama attacks which left 40 Indian paramilitary personnel dead in 2019.\n\nWhy is Kashmir a flashpoint between India and Pakistan?",
    "url": "https://www.bbc.com/news/articles/cj6868pdpw4o"
  },
  {
    "title": "how will Pakistan respond? Four key questions",
    "text": "Indian air strikes - how will Pakistan respond? Four key questions\n\n4 days ago Share Save Soutik Biswas • @soutikBBC India correspondent Share Save\n\nReuters Pakistan claims to have shot down five Indian fighter jets - India has not confirmed this\n\nIn a dramatic overnight operation, India said it launched missile and air strikes on nine sites across Pakistan and Pakistan-administered Kashmir, targeting what it called militant positions based on \"credible intelligence\". The strikes, lasting just 25 minutes between 01:05 and 01:30 India time (19:35 and 20:00 GMT on Tuesday), sent shockwaves through the region, with residents jolted awake by thunderous explosions. Pakistan said only six locations were hit and claimed to have shot down five Indian fighter jets and a drone - a claim India has not confirmed. Islamabad said 26 people were killed and 46 injured in Indian air strikes and shelling across the Line of Control (LoC) - the de facto border between India and Pakistan. Meanwhile, India's army reported that 10 civilians were killed by Pakistani shelling on its side of the de facto border. Follow the latest updates\n\nWhat we know about the air strikes This sharp escalation comes after last month's deadly militant attack on tourists in Pahalgam in Indian-administered Kashmir, pushing tensions between the nuclear-armed rivals to dangerous new heights. India says it has clear evidence linking Pakistan-based terrorists and external actors to the attack - a claim Pakistan flatly denies. Islamabad has also pointed out that India has not offered any evidence to support its claim.\n\nDoes this attack mark a new escalation?\n\nIn 2016, after 19 Indian soldiers were killed in Uri, India launched \"surgical strikes\" across the LoC. In 2019, the Pulwama bombing, which left 40 Indian paramilitary personnel dead, prompted airstrikes deep into Balakot - the first such action inside Pakistan since 1971 - sparking retaliatory raids and an aerial dogfight. Experts say the retaliation for the Pahalgam attack stands out for its broader scope, targeting the infrastructure of three major Pakistan-based militant groups simultaneously. India says it struck nine militant targets across Pakistan and Pakistan-administered Kashmir, hitting deep into key hubs of Lashkar-e- Taiba (LeT), Jaish-e-Mohammed, and Hizbul Mujahideen. Among the closest targets were two camps in Sialkot, just 6-18km from the border, according to an Indian spokesperson. The deepest hit, says India, was a Jaish-e-Mohammed headquarters in Bahawalpur, 100km inside Pakistan. A LeT camp in Muzaffarabad, 30km from the LoC and capital of Pakistan-administered Kashmir, was linked to recent attacks in Indian-administered Kashmir, the spokesperson said. Pakistan says six locations have been hit, but denies allegations of there being terror camps.\n\nAnadolu via Getty Images Pakistan says six locations have been hit, including in Muzaffarabad, capital of Pakistan-administered Kashmir\n\n\"What's striking this time is the expansion of India's targets beyond past patterns. Previously, strikes like Balakot focused on Pakistan-administered Kashmir across the Line of Control - a militarised boundary,\" Srinath Raghavan, a Delhi-based historian, told the BBC. \"This time, India has hit into Pakistan's Punjab, across the International Border, targeting terrorist infrastructure, headquarters, and known locations in Bahawalpur and Muridke linked to Lashkar-e-Taiba. They've also struck Jaish-e-Mohammed and Hizbul Mujahideen assets. This suggests a broader, more geographically expansive response, signalling that multiple groups are now in India's crosshairs - and sending a wider message,\" he says. The India-Pakistan International Border is the officially recognised boundary separating the two countries, stretching from Gujarat to Jammu. Ajay Bisaria, a former Indian high commissioner to Pakistan, told the BBC that what India did was a \"Balakot plus response meant to establish deterrence, targeting known terrorist hubs, but accompanied by a strong de-escalatory message\". \"These strikes were more precise, targeted and more visible than in the past. Therefore, [they are] less deniable by Pakistan,\" Mr Bisaria says. Indian sources say the strikes were aimed at \"re-establishing deterrence\". \"The Indian government thinks that the deterrence established in 2019 has worn thin and needs to be re-established,\" says Prof Raghavan. \"This seems to mirror Israel's doctrine that deterrence requires periodic, repeated strikes. But if we assume that hitting back alone will deter terrorism, we risk giving Pakistan every incentive to retaliate - and that can quickly spiral out of control.\"\n\nCould this spiral into a broader conflict?\n\nAFP via Getty Images Smoke rises after an artillery shell hits the main town in India's Jammu region on Wednesday\n\nThe majority of experts agree that a retaliation from Pakistan is inevitable - and diplomacy will come into play. \"Pakistan's response is sure to come. The challenge would be to manage the next level of escalation. This is where crisis diplomacy will matter,\" says Mr Bisaria. \"Pakistan will be getting advice to exercise restraint. But the key will be the diplomacy after the Pakistani response to ensure that both countries don't rapidly climb the ladder of escalation.\" India and Pakistan are in crisis again - here's how they de-escalated in the past Pakistan-based experts like Ejaz Hussain, a Lahore-based political and military analyst, say Indian surgical strikes targeting locations such as Muridke and Bahawalpur were \"largely anticipated given the prevailing tensions\". Dr Hussain believes retaliatory strikes are likely. \"Given the Pakistani military's media rhetoric and stated resolve to settle the scores, retaliatory action, possibly in the form of surgical strikes across the border, appears likely in the coming days,\" he told the BBC. But Dr Hussain worries that surgical strikes on both sides could \"escalate into a limited conventional war\". Christopher Clary of the University at Albany in the US believes given the scale of India's strikes, \"visible damage at key sites\", and reported casualties, Pakistan is highly likely to retaliate. \"Doing otherwise essentially would give India permission to strike Pakistan whenever Delhi feels aggrieved and would run contrary to the Pakistan military's commitment to retaliating with 'quid pro quo plus',\" Mr Clary, who studies the politics of South Asia, told the BBC. \"Given India's stated targets of groups and facilities associated with terrorism and militancy in India, I think it is likely - but far from certain - that Pakistan will confine itself to attacks on Indian military targets,\" he said. Despite the rising tensions, some experts still hold out hope for de-escalation. \"There is a decent chance we escape this crisis with just one round of reciprocal standoff strikes and a period of heightened firing along the Line of Control,\" says Mr Clary. However, the risk of further escalation remains high, making this the \"most dangerous\" India-Pakistan crisis since 2002 - and even more perilous than the 2016 and 2019 standoffs, he adds.\n\nIs Pakistani retaliation now inevitable?\n\nAFP via Getty Images Indian paramilitary personnel stand guard along a road in Srinagar on Tuesday\n\nExperts in Pakistan note that despite a lack of war hysteria leading up to India's strike, the situation could quickly shift. \"We have a deeply fractured political society, with the country's most popular leader behind bars. Imran Khan's imprisonment triggered a strong anti-military public backlash,\" says Umer Farooq, an Islamabad-based analyst and a former correspondent of Jane's Defence Weekly. \"Today, the Pakistani public is far less eager to support the military compared to 2016 or 2019 - the usual wave of war hysteria is noticeably absent. But if public opinion shifts in central Punjab where anti-India feelings are more prevalent, we could see increased civilian pressure on the military to take action. And the military will regain popularity because of this conflict.\" Dr Hussain echoes a similar sentiment. \"I believe the current standoff with India presents an opportunity for the Pakistani military to regain public support, particularly from the urban middle classes who have recently criticised it for perceived political interference,\" he says. \"The military's active defence posture is already being amplified through mainstream and social media, with some outlets claiming that six or seven Indian jets were shot down. \"Although these claims warrant independent verification, they serve to bolster the military's image among segments of the public that conventionally rally around national defence narratives in times of external threat.\"\n\nCan India and Pakistan step back from the brink?\n\nNurPhoto via Getty Images Indian security forces patrolling in Uri, Jammu and Kashmir",
    "url": "https://www.bbc.com/news/articles/cd020710v1ko"
  },
  {
    "title": "India reports strikes on military bases, Pakistan denies any role",
    "text": "India reports strikes on military bases, Pakistan denies any role\n\n2 days ago Share Save Frances Mao BBC News Share Save\n\nEPA Pakistani security officials inspect the site of an alleged Indian drone strike in Karachi\n\nIndia has accused Pakistan of attacking three of its military bases with drones and missiles, a claim which has been denied by Islamabad. The Indian Army said it had foiled Pakistan's attempts to attack its bases in Jammu and Udhampur, in Indian-administered Kashmir, and Pathankot, in India's Punjab state. Blasts were reported on Thursday evening in Jammu city in Indian-administered Kashmir as the region went into a blackout. Pakistan's defence minister told the BBC they were not behind the attack. \"We deny it, we have not mounted anything so far,\" Khawaja Asif told the BBC, adding: \"We will not strike and then deny\".\n\nEPA Blasts were reported in the city of Jammu which went into a black-out\n\nEarlier on Thursday, India said it had struck Pakistan's air defences and \"neutralised\" Islamabad's attempts to hit military targets in India on Wednesday night. Pakistan called that action another \"act of aggression\", following Indian missile strikes on Wednesday on targets in Pakistan and Pakistani-administered Kashmir. India's strikes on Wednesday sparked a chorus of calls for de-escalation from the international community with the UN and world leaders calling for calm. The attacks and incidents of shelling along the border have fanned fears of wider conflict erupting between the nuclear-armed states. It is being viewed as the worst confrontation between the two countries in more than two decades. India said it hit nine \"terrorist infrastructure\" sites on Wednesday in retaliation for a militant attack on tourists in Indian-administered Kashmir last month. Pakistan has strongly denied Indian claims that it backed the militants who killed 26 civilians in the mountainous town of Pahalgam. It was the bloodiest attack on civilians in the region for years, sending tensions soaring. Most of the victims were Indian tourists. Indian-administered Kashmir has seen a decades-long insurgency against Indian rule which has claimed thousands of lives. Kashmir has been a flashpoint between the countries since they became independent after British India was partitioned in 1947. Both claim Kashmir and have fought two wars over it.\n\nReuters Locals in border areas have had to be evacuated due to the cross-border shelling - here women and children arrive at a shelter near Jammu\n\nThere were calls for restraint from around the world after India launched \"Operation Sindoor\" early on Wednesday. But on Thursday both sides accused each other of further military action. Pakistan's military spokesman said drones sent by India had been engaged in multiple locations. \"Last night, India showed another act of aggression by sending drones to multiple locations,\" Lt Gen Ahmed Sharif Chaudhry said. \"These locations are Lahore, Gujranwala, Chakwal, Rawalpindi, Attock, Bahawalpur, Miano, Chor and near Karachi.\" He said one civilian had been killed in Sindh province and four troops injured in Lahore. The US consulate in Lahore told its staff to shelter in the building. India said its latest action had been taken in response to Pakistan's attempts to \"engage a number of military targets in northern and western India\" overnight. \"It has been reliably learnt that an Air Defence system at Lahore has been neutralised,\" a Defence Ministry statement said. Pakistan denied the claim. There was no independent confirmation of the two countries' versions of events. Later in the day India's foreign secretary Vikram Misri told a news conference in Delhi: \"Our intention has not been to escalate matters, we are only responding to the original escalation.\"",
    "url": "https://www.bbc.com/news/articles/cjrndypy3l4o"
  },
  {
    "title": "India and Pakistan accuse each other of 'violations' after ceasefire deal",
    "text": "India and Pakistan accuse each other of 'violations' after ceasefire deal\n\n11 hours ago Share Save Alex Kleiderman BBC News Share Save\n\nEPA Damaged vehicles and houses in Jammu, Indian-administered Kashmir, on 10 May 2025\n\nIndia and Pakistan have accused each other of \"violations\" hours after the two nations said they had agreed to a ceasefire following days of cross-border military strikes. After sounds of explosions were heard in Indian-administered Kashmir, India's Foreign Secretary Vikram Misri said there had been \"repeated violations of the understanding we arrived at\". A short while later, Pakistan's foreign ministry said it remained \"committed to faithful implementation of a ceasefire...notwithstanding the violations being committed by India in some areas\". The fighting between India and Pakistan over the last four days has been the worst military confrontation between the two rivals in decades.\n\nThe use of drones, missiles and artillery started when India struck targets in Pakistan and Pakistan-administered Kashmir in response to a deadly militant attack in Pahalgam last month. Pakistan had denied any involvement. After four days of cross-border strikes, India and Pakistan said they had agreed on a full and immediate ceasfire. US President Donald Trump announced the news on his Truth Social Platform on Saturday morning. He said it had been brokered by the US. Pakistan's Foreign Minister later confirmed the agreement had been reached by the two countries, adding that \"three dozen countries\" were involved in the diplomacy. But hours after the announcement, residents - and BBC reporters - in the main Indian-administered Kashmiri cities of Srinagar and Jammu reported hearing the sounds of explosions and seeing flashes in the sky. Indian Foreign Secretary Vikram Misri said: \"For the last few hours, there have been repeated violations of the understanding we arrived at earlier this evening. \"This is a breach of the understanding arrived at earlier today.\" Misri said India's armed forces was \"giving an appropriate response\" and he concluded his briefing by \"calling upon Pakistan to address these violations\". In response, a spokesman for Pakistan's Ministry of Foreign Affairs said: \"Pakistan remains committed to faithful implementation of ceasefire between Pakistan and India, announced earlier today. \"Notwithstanding the violations being committed by India in some areas, our forces are handling the situation with responsibility and restraint. \"We believe that any issues in smooth implementation of the ceasefire should be addressed through communication at appropriate levels. \"The troops on ground should also exercise restraint.\"\n\nIndia confirms ceasefire with Pakistan",
    "url": "https://www.bbc.com/news/articles/cvg9d913v20o"
  },
  {
    "title": "India and Pakistan accuse each other of ‘violations’ after ceasefire deal",
    "text": "Trump's involvement isn't surprising - but it is important\n\nJake Kwon\n\nReporting from Washington\n\nImage source, Reuters Image caption, Trump says the agreement between India and Pakistan was reached after a long night of mediations with his US administration\n\nIsolationism is in the DNA of the Trump administration and until recently it was projecting a hand-off approach in this conflict.\n\nVice-President JD Vance previously described a potential war between India and Pakistan as \"none of our business\" during an interview with Fox News.\n\nBut this was becoming a conflict that the White House could not ignore.\n\nOn a personal level, President Trump sees himself as a peacemaker in global conflicts. He's regularly dispatched his most trusted envoy to Israel and Russia with instructions to broker ceasefires.\n\nWith tensions between Islamabad and Delhi threatening to boil over, it was par for the course for Trump to get involved.\n\nBut on a more strategic level, Washington sees India as a centrepiece in containing China.\n\nIn the strategy that goes back several administrations, the US had enveloped China with a line of allies from South Korea to India. As well as heightening military co-operation, India was a main partner in the Biden administration's strategy of \"friend-shoring\" to reduce American reliance on Chinese manufacturing.\n\nThough Trump criticised India's trade barriers, he signed a deal with Prime Minister Modi to further expand security co-operation and trade.\n\nWhile Pakistan is now aligning with China and Iran, Washington may have viewed the prospect of its close ally India getting into a dangerous conflict as too great a risk to regional security.",
    "url": "https://www.bbc.com/news/live/cwy3jnl3nvwt"
  },
  {
    "title": "India and Pakistan blame each other for escalating military tensions",
    "text": "More from Pakistan's defence minister\n\nAzadeh Moshiri\n\nBBC Pakistan correspondent\n\nWe bring you more lines from our interview with Pakistan's Defence Minister Khawaja Asif.\n\nHe told the BBC that \"it will be known all over the world\" when Pakistan decides to attack, adding that the country will not deny any actions it took.\n\nPakistan's allies have advised the country to demonstrate restraint, the minister said.\n\nHe added that his country was \"restraining itself\" but had \"reached a point where there's no breakthrough\".\n\nAsif said US Secretary of State Marco Rubio had spoken to the prime minister of Pakistan, and perhaps that conversation could offer some hope, but he believes there has been \"no let-up\" from India and Pakistan has to react.\n\nHe was speaking to the BBC just moments after reports of explosions and blackout in Indian-administered Kashmir.",
    "url": "https://www.bbc.com/news/live/cwyneele13qt"
  },
  {
    "title": "Kashmir: Why India and Pakistan fight over it",
    "text": "Kashmir: Why India and Pakistan fight over it\n\n4 days ago Share Save Share Save\n\nReuters Kashmir has been a source of conflict between India and Pakistan for decades\n\nNuclear-armed neighbours India and Pakistan have fought two wars and a limited conflict over Kashmir. But why do they dispute the territory - and how did it start?\n\nHow old is this conflict?\n\nKashmir is an ethnically diverse Himalayan region famed for the beauty of its lakes, meadows and snow-capped mountains. Even before India and Pakistan won their independence from Britain in August 1947, the area was hotly contested. Under the partition plan provided by the Indian Independence Act, Muslim-majority Kashmir was free to accede to either India or Pakistan. The maharaja (local ruler), Hari Singh, initially wanted Kashmir to become independent - but in October 1947 chose to join India, in return for its help against an invasion of tribesmen from Pakistan.\n\nA war erupted and India asked the United Nations to intervene. The UN recommended holding a plebiscite to settle the question of whether the state would join India or Pakistan. However, the two countries could not agree to a deal to demilitarise the region before the referendum could be held. In July 1949, India and Pakistan signed an agreement to establish a ceasefire line as recommended by the UN and the region became divided.\n\nAFP Kashmir is known by some as India's Switzerland, due to its verdant fields and sweeping mountainscapes\n\nA second war followed in 1965. Then in 1999, India fought a brief but bitter conflict with Pakistani-backed forces. By that time, India and Pakistan were declared nuclear powers. Today, Delhi and Islamabad both claim Kashmir in full, but control only parts of it.\n\nWhy has there been so much unrest in the Indian-administered part?\n\nWithin Indian-administered Kashmir, opinions about the territory's rightful allegiance are diverse and strongly held. Many do not want it to be governed by India, or prefer a return to the semi-autonomous status that they had until 2019. Some also want outright independence. Religion is also an important factor: Indian-administered Kashmir is more than 60% Muslim, making it the only part of India where Muslims are in the majority. An armed revolt has been waged against Indian rule in the region since 1989, claiming tens of thousands of lives. India accuses Pakistan of backing militants in Kashmir - a charge its neighbour denies. In 2019, Indian-administered Kashmir was stripped of its semi-autonomous status by the government in Delhi amid a huge security crackdown. For several years after the revocation of the region's special status, militancy waned and tourist visits soared.\n\nWhat happened after previous Kashmir militant attacks?\n\nIn 2016, after 19 Indian soldiers were killed in Uri, India launched \"surgical strikes\" across the Line of Control - the de facto border between India and Pakistan - targeting alleged militant bases. In 2019, the Pulwama bombing, which left more than 40 Indian paramilitary personnel dead, prompted Indian airstrikes deep into Balakot - the first such action inside Pakistan since 1971 - sparking retaliatory raids and an aerial dogfight. Tensions rose again in April 2025 after years of relative calm when militants killed 26 people in an attack on tourists near the resort town of Pahalgam in Indian-administered Kashmir. It was the deadliest attack on civilians in two decades. India responded two weeks later with missile strikes on targets in Pakistan and Pakistan-administered Kashmir, once again raising fears of further escalation and calls for restraint. Kashmir remains one of the most militarised zones in the world.\n\nWhat about hopes for peace?\n\nIndia and Pakistan did agree a ceasefire in 2003. In 2014, India's current Prime Minister Narendra Modi came to power promising a tough line on Pakistan, but also showed interest in holding peace talks.\n\nGetty Pakistan and India's prime ministers promised peace in 2014",
    "url": "https://www.bbc.com/news/articles/c30q09638n8o"
  },
  {
    "title": "Devastation among locals after India strikes Pakistan and Pakistan-administered Kashmir",
    "text": "Indian and Pakistani civilians describe aftermath of strikes and shelling\n\n4 days ago Share Save Aamir Peerzada, BBC News Reporting from Srinagar Farhat Javed, BBC Urdu Reporting from Muzaffarabad Share Save\n\nEPA An Indian paramilitary soldier keeps watch from behind a fence in Srinagar, the summer capital of Indian-administered Kashmir\n\nMohammed Waheed was fast asleep at his home in Pakistan-administered Kashmir in the early hours of Wednesday morning when a huge blast shook his home. \"Before we could even process what was happening, more missiles struck, causing widespread panic and chaos,\" he told the BBC, adding that he had jumped out of bed and run outside along with his family and neighbours. \"Children were crying, women were running around, trying to find safety.\" Mr Waheed lives in Muzaffarabad, the capital of Pakistan-administered Kashmir - it is one of at least three places that were hit by Indian missile strikes on Wednesday. The Indian military said it carried out the strikes in response to a militant attack in Indian-administered Kashmir that killed 26 civilians. It has blamed Pakistan-based militant groups for the attacks, accusing Islamabad of tacitly supporting them - a charge Pakistan has consistently denied. The BBC spoke to witnesses in both Indian and Pakistan administered Kashmir who described the strikes by India as well as the aftermath of shelling by Pakistan.\n\nWatch: Sense of fear and uncertainty - BBC reports from Pakistan-administered Kashmir\n\nPakistan said eight civilians were killed and 35 others injured as a result of the strikes this morning, according to Islamabad. India's army has also said that at least seven civilians have been killed by Pakistani shelling on its side of the Line of Control (LoC) - the de facto border between both countries.\n\n'Killed while making tea'\n\nRuby Kaur, who lived in India's Poonch district along the LoC has been identified as one of the Indians who has been killed. Her uncle, Buava Singh, told the BBC that a mortar shell struck near Ms Kaur's house around 1:45 am, killing her on the spot and injuring her daughter. \"Her husband was not keeping well. She woke up to make tea for him when the mortar shell landed close to her house,\" he said. He added that the heavy shelling on Wednesday morning was something \"we have never seen so far\". Singh says that there were no community bunkers in the area, which meant residents were forced to take shelter in their homes. \"The shrapnel hit her head. She was bleeding heavily. We rushed her to a nearby hospital, but she was declared dead,\" Mr Singh said. Another resident from Poonch said they heard \"loud explosions for hours on Wednesday night\". \"It was a panicky situation across the city and other areas close to the Line of Control (LoC),\" Dr Zamrood Mughal said over phone. \"People couldn't sleep the entire night. People abandoned their homes and ran for safer places. A shell hit the main town near the forest office and damaged the nearby structure.\"\n\nWatch: Airports closed, eerie silence in Indian-administered Kashmir\n\nReuters A damaged portion of Bilal Mosque is seen after it was hit by an Indian strike in Muzaffarabad\n\n'Terrified of what might come next'",
    "url": "https://www.bbc.com/news/articles/c62g2d3xlj2o"
  },
  {
    "title": "'It felt like the sky turned red', says witness to India strike in Pakistan",
    "text": "'It felt like the sky turned red', says witness to India strike in Pakistan\n\nOn Wednesday morning, dozens of people gathered on the perimeter of a sprawling complex in the Pakistani city of Muridke to see the damage for themselves.\n\nOvernight, Indian missiles had pounded buildings at this site, which lies not far from the border with India in Pakistan's Punjab region, and just a short drive from the major city of Lahore.\n\nNo one was being allowed into the complex - but even from a distance as BBC reporters peered through the barbed wire fence surrounding it, the damage was unmistakable.\n\nThe BBC spoke to people on the ground who witnessed the bombardment first-hand.\n\n\"It was the main mosque that got targeted,\" one man said. \"The sky lit up and it felt like the sky turned red.\"\n\nAnother said: \"A sudden missile appeared and there was a blast. I immediately got out the house.\n\n\"I had only reached the mosque near my house when there were three more consecutive blasts. I heard all three, they were really loud.\"\n\nWhen a BBC team arrived in Muridke, security service personnel were closely controlling access to the site.",
    "url": "https://www.bbc.com/news/articles/cd7v7pdr095o"
  },
  {
    "title": "India and Pakistan blame each other for escalating military tensions",
    "text": "US taking a hands-off approach\n\nTom Bateman\n\nUS State Department correspondent\n\nThe White House is taking a hands-off approach to this crisis, characterised by Donald Trump’s Oval Office comment on Tuesday that \"it’s a shame”.\n\nToday he says there is a “tit-for-tat”, and he wants “to see it stop”, but without specifying how.\n\nThe US State Department said on Tuesday night it was monitoring the situation but is still yet to update that statement.\n\nThe lack of an explicit American call for restraint since the Indian strikes, leaving other countries to fill that diplomatic void, reflects the US’s strengthening ties with India over recent years, and the relative isolation of Pakistan, with which the US has long had a more troubled relationship.\n\nIt appears the White House has been attempting to leave Delhi with space to act. But that approach might not last long.\n\nDuring the last major crisis between India and Pakistan in 2019, the Trump administration at first fully-backed what it saw as India’s right to target militants who had struck in Indian-administered Kashmir, but quickly turned to calls for de-escalation as the crisis rapidly escalated.",
    "url": "https://www.bbc.co.uk/news/live/cwyneele13qt?page=4"
  },
  {
    "title": "Watch: How tensions escalated between India and Pakistan",
    "text": "In the early hours of Wednesday, India said it had launched a series of missile strikes on what it called \"terrorist infrastructure sites\" in Pakistan and Pakistan-administered Kashmir. Pakistan said six locations were hit, with 26 people killed and 46 injured.\n\nMeanwhile, India's army said 10 civilians were killed by Pakistani shelling on its side of the de facto border. Pakistan said it shot down five Indian jets and a drone. Delhi has not commented on this.\n\nHear from BBC reporters and witnesses on the ground about how the day of escalating tensions unfolded.\n\nVideo produced by Anahita Sachdev.",
    "url": "https://www.bbc.com/news/videos/cx262wl9z91o"
  },
  {
    "title": "Global leaders call for 'de-escalation' of India-Pakistan tensions",
    "text": "Global leaders call for 'restraint' as India-Pakistan tensions escalate\n\nThe site of an Indian missile strike near Bahawalpur, Punjab province, Pakistan\n\nWorld leaders urged the two sides to exercise \"restraint\" and called for a de-escalation of tensions.\n\nIndian police alleged that two of the attackers were Pakistani nationals, with Delhi accusing Pakistan of supporting militants - a charge Islamabad denies.\n\nIndia said it acted in response to a militant attack in Indian-administered Kashmir two weeks ago that killed 25 Indians and one Nepali. Pakistan has denied involvement in the attack.\n\nOvernight into Wednesday, India launched strikes on sites in Pakistan and Pakistan-administered Kashmir.\n\nA diplomatic push is underway to bring India and Pakistan back from the brink as tensions between the nuclear-armed neighbours have escalated.\n\n\"The world cannot afford a military confrontation between India and Pakistan,\" UN Secretary-General António Guterres's spokesman said.\n\nHe said Guterres is calling for \"maximum military restraint from both countries\".\n\nUK Foreign Secretary David Lammy said the situation was a \"serious concern\".\n\n\"The UK government is urging India and Pakistan to show restraint and engage in direct dialogue to find a swift, diplomatic path forward,\" Lammy said. \"I have made clear to my counterparts in India and Pakistan that if this escalates further, nobody wins.\"\n\nLammy also said the safety of British nationals in the region was \"our priority\", with the UK foreign office monitoring developments closely.\n\nUS President Donald Trump called it a \"shame\" and said that he \"hopes it ends very quickly\".\n\nChina's foreign ministry said India's military operation was \"regrettable\". The foreign ministry spokesperson said they were \"concerned\" about the ongoing situation and asked both countries to \"remain calm, exercise restraint and refrain from taking actions that may further complicate the situation\".\n\nFrance's Foreign Minister Jean-Noël Barrot told French media: \"We understand India's desire to protect itself against the scourge of terrorism, but we obviously call on both India and Pakistan to exercise restraint to avoid escalation and, of course, to protect civilians.\"\n\nIran's Foreign Minister Seyed Abbas Araghchi travelled to Delhi and is due to meet with India's president and external affairs minister on Thursday, after holding talks with Pakistan's army chief and prime minister earlier this week.\n\nIran has offered to mediate between India and Pakistan.\n\nIndia said its strikes had targeted sites \"from where terrorist attacks against India have been planned and directed\" and \"no Pakistani military facilities have been targeted\".\n\nPakistan said six locations had been hit, but denied India's allegations of these being terrorist infrastructure.\n\nPakistani authorities said India's strikes had killed 31 people. Indian authorities said at least 15 civilians had been killed by Pakistani shelling.\n\nPakistan's military said it had shot down five Indian aircraft and a drone. India has yet to respond to these claims.\n\nPakistan's Prime Minister Shehbaz Sharif said the air force made its defence - which was a \"reply from our side to them\".",
    "url": "https://www.bbc.com/news/articles/c78j8vdlg38o"
  },
  {
    "title": "India-Pakistan: No cricket matches until Kashmir attack conflict resolved - Gautam Gambhir",
    "text": "India and Pakistan last met in the Champions Trophy in February. That match was played in Dubai because the India refused to travel to Pakistan for the tournament.\n\nFixtures at world tournaments, such as World Cups and the Champions Trophy, are dictated by the International Cricket Council and the event's schedule.\n\nIndia-Pakistan fixtures generate significant income, are regularly the most-watched and are played at the largest stadiums.\n\nOutside of that, matches are arranged by the national boards, but India and Pakistan have not met since Pakistan toured India in 2013.\n\nTheir men's sides could meet at the T20 World Cup next year.\n\n\"Ultimately, this is government's decision whether we play them or not,\" said Gambhir, a former member of parliament for Prime Minister Narendra Modi's Bharatiya Janata Party (BJP).\n\n\"I have said this before also: no cricket match or Bollywood or any other interaction is more important than the life of Indian soldiers and Indian citizens.\n\n\"Matches will keep happening, movies will be made, singers will continue to perform, but nothing comes close to losing a loved one in your family.\"\n\nAfter the attack on 22 April, India introduced several measures against Pakistan, including suspending a water-sharing agreement and banning Pakistani aircraft from its airspace.\n\nPakistan responded with numerous tit-for-tat-measures, while Instagram accounts of a number of Pakistani film actors and celebrities were blocked in India.\n\nIndia has not named any group it suspected of carrying out the attack in Pahalgam and it remains unclear who did it.\n\nIndian police have alleged two of the attackers were Pakistani nationals, with Delhi accusing Pakistan of supporting militants - a charge Islamabad denies. It says it has nothing to do with the 22 April attacks.\n\nThe situation escalated on Tuesday evening when India launched a series of strikes in a move named \"Operation Sindoor\".\n\nPakistan's military spokesperson Lt Gen Ahmed Sharif Chaudhry said at least 26 people were killed and 46 injured.\n\nIndia's army said at least 15 civilians were killed by Pakistani shelling on its side of the de facto border in Kashmir.\n\nThursday's match in the Indian Premier League between Punjab Kings and Delhi Capitals is scheduled to take place in Dharamsala in the state of Himachal Pradesh, which borders Kashmir.\n\nA number of flights into Dharamsala's airport were cancelled on Wednesday following directives from aviation authorities in India.\n\nThe Pakistan Super League is scheduled to continue in Rawalpindi on Wednesday.",
    "url": "https://www.bbc.com/sport/cricket/articles/ce8g8xkv3m5o"
  },
  {
    "title": "India and Pakistan face conflict again",
    "text": "India and Pakistan are in crisis again - here's how they de-escalated in the past\n\n3 May 2025 Share Save Soutik Biswas • @soutikBBC India correspondent Share Save\n\nGetty Images Cross-border and aerial strikes by India have become the new norm\n\nLast week's deadly militant attack in Pahalgam in Indian-administered Kashmir, which claimed 26 civilian lives, has reignited a grim sense of déjà vu for India's security forces and diplomats. This is familiar ground. In 2016, after 19 Indian soldiers were killed in Uri, India launched \"surgical strikes\" across the Line of Control – the de facto border between India and Pakistan - targeting militant bases. In 2019, the Pulwama bombing, which left 40 Indian paramilitary personnel dead, prompted airstrikes deep into Balakot - the first such action inside Pakistan since 1971 - sparking retaliatory raids and an aerial dogfight. And before that, the horrific 2008 Mumbai attacks - a 60-hour siege on hotels, a railway station, and a Jewish centre - claimed 166 lives. Each time, India has held Pakistan-based militant groups responsible for the attacks, accusing Islamabad of tacitly supporting them - a charge Pakistan has consistently denied. Since 2016, and especially after the 2019 airstrikes, the threshold for escalation has shifted dramatically. Cross-border and aerial strikes by India have become the new norm, provoking retaliation from Pakistan. This has further intensified an already volatile situation. Once again, experts say, India finds itself walking the tightrope between escalation and restraint - a fragile balance of response and deterrence. One person who understands this recurring cycle is Ajay Bisaria, India's former high commissioner to Pakistan during the Pulwama attack, who captured its aftermath in his memoir, Anger Management: The Troubled Diplomatic Relationship between India and Pakistan.\n\nGetty Images The 2019 Pulwama bombing, which killed 40 paramilitary personnel, triggered Indian airstrikes in Balakot, Pakistan\n\n\"There are striking parallels between the aftermath of the Pulwama bombing and the killings in Pahalgam,\" Mr Bisaria told me on Thursday, 10 days after the latest attack. Yet, he notes, Pahalgam marks a shift. Unlike Pulwama and Uri, which targeted security forces, this attack struck civilians - tourists from across India - evoking memories of the 2008 Mumbai attacks. \"This attack carries elements of Pulwama, but much more of Mumbai,\" he explains. \"We're once again in a conflict situation, and the story is unfolding in much the same way,\" Mr Bisaria says. A week after the latest attack, Delhi moved quickly with retaliatory measures: closing the main border crossing, suspending a key water-sharing treaty, expelling diplomats, and halting most visas for Pakistani nationals - who were given days to leave. Troops on both sides have exchanged intermittent small-arms fire across the border in recent days. Delhi also barred all Pakistani aircraft - commercial and military - from its airspace, mirroring Islamabad's earlier move. Pakistan retaliated with its own visa suspensions and suspended a 1972 peace treaty with India. (Kashmir, claimed in full by both India and Pakistan but administered in parts by each, has been a flashpoint between the two nuclear-armed nations since their partition in 1947.)\n\nAjay Bisaria Ajay Bisaria (left) returned to Islamabad as India's high commissioner 22 days after the Pulwama attack\n\nIn his memoir, Mr Bisaria recounts India's response after the Pulwama attack on 14 February 2019. He was summoned to Delhi the morning after, as the government moved quickly to halt trade - revoking Pakistan's most-favoured-nation status, granted in 1996. In the following days, the Cabinet Committee on Security (CCS) imposed a 200% customs duty on Pakistani goods, effectively ending imports, and suspended trade at the land border at Wagah. Mr Bisaria notes that a broader set of measures was also proposed to scale down engagement with Pakistan, most of which were subsequently implemented. They included suspending a cross-border train known as the Samjhauta Express, and a bus service linking Delhi and Lahore; deferring talks between border guards on both sides and negotiations over the historic Kartarpur corridor to one of Sikhism's holiest shrines, halting visa issuance, ceasing cross border, banning Indian travel to Pakistan, and suspending flights between the two countries. \"How hard it was to build trust, I thought. And how easy was it to break it,\" Mr Bisaria writes. \"All the confidence-building measures planned, negotiated, and implemented over years in this difficult relationship, could be slashed off on a yellow notepad in minutes.\" The strength of the Indian high commission in Islamabad was reduced from 110 to 55 only in June 2020 after a separate diplomatic incident. (It now stands at 30 after the Pahalgam attack.) India also launched a diplomatic offensive. A day after the attack, then foreign secretary Vijay Gokhale briefed envoys from 25 countries - including the US, UK, China, Russia, and France - on the role of Jaish-e-Mohammad (JeM), the Pakistan-based militant group behind the bombing, and accused Pakistan of using terrorism as state policy. JeM, designated a terrorist organisation by India, the UN, the UK, and the US, had claimed responsibility for the bombing.\n\nAFP Indians in Mumbai celebrate the Balakot airstrike in February 2019\n\nIndia's diplomatic offensive continued on 25 February, 10 days after the attack, pushing for JeM chief Masood Azhar's designation as a terrorist by the UN sanctions committee and inclusion on the EU's \"autonomous terror list\". While there was pressure to abrogate the Indus Waters Treaty - a key river water sharing agreement - India opted instead to withhold any data beyond treaty obligations, Mr Bisaria writes. A total of 48 bilateral agreements were reviewed for possible suspension. An all-party meeting was convened in Delhi, resulting in a unanimous resolution. At the same time, communication channels remained open - including the hotline between the two countries' Directors General of Military Operations (DGMO), a key link for military-to-military contact, as well as both high commissions. In 2019, as now, Pakistan said the attack was a \"false-flag operation\". Much like this time a crackdown in Kashmir saw the arrest of over 80 \"overground workers\" - local supporters who may have provided logistical help, shelter, and intelligence to militants from the Pakistan-based group. Rajnath Singh, then Indian home minister, visited Jammu and Kashmir, and dossiers on the attack and suspected perpetrators were prepared. In a meeting with the external affairs minister Sushma Swaraj, Mr Bisaria told her that \"that India's diplomatic options in dealing with a terrorist attack of this nature was limited\". \"She gave me the impression that some tough action was round the corner, after which, I should expect the role of diplomacy to expand,\" Mr Bisaria writes. On 26 February, Indian airstrikes - its first across the international border since 1971 - targeted JeM's training camp in Balakot. Six hours later, the Indian foreign secretary announced the strikes had killed \"a very large number\" of militants and commanders. Pakistan swiftly denied the claim. More high-level meetings followed in Delhi.\n\nAFP Indian security forces with photos of captured pilot Abhinandan Varthaman at a prayer event, March 2019\n\nThe crisis escalated dramatically the next morning, 27 February, when Pakistan launched retaliatory air raids. In the ensuing dogfight, an Indian fighter jet was shot down, and its pilot, Wing Commander Abhinandan Varthaman, ejected and landed in Pakistan-administered Kashmir. Captured by Pakistani forces, his detention in enemy territory triggered a wave of national concern and further heightened tensions between the two nuclear-armed neighbours. Mr Bisaria writes India activated multiple diplomatic channels, with US and UK envoys pressing Islamabad. The Indian message was \"any attempt by Pakistan to escalate situation further or to cause harm to the pilot would lead to escalation by India.\" Pakistani prime minister Imran Khan announced the pilot's release on 28 February, with the handover occurring on 1 March under prisoner of war protocol. Pakistan presented the move as a \"goodwill gesture\" aimed at de-escalating tensions. By 5 March, with the dust settling from Pulwama, Balakot, and the pilot's return, India's political temperature had cooled. The Cabinet Committee on Security decided to send India's high commissioner back to Pakistan, signalling a shift towards diplomacy. \"I arrived in Islamabad on 10 March, 22 days after leaving in the wake of Pulwama. The most serious military exchange since Kargil had run its course in less than a month,\" Mr Bisaria writes, \"India was willing to give old-fashioned diplomacy another chance.... This, with India having achieved a strategic and military objective and Pakistan having claimed a notion of victory for its domestic audience.\"\n\nAFP The 2008 Mumbai attacks - a 60-hour siege on hotels, a railway station, and a Jewish centre - claimed 166 lives",
    "url": "https://www.bbc.com/news/articles/cn4wk22vk4zo"
  },
  {
    "title": "Misleading Kashmir posts obtaining millions of views on X",
    "text": "Misleading posts obtaining millions of views on X\n\n4 days ago Share Save Matt Murphy, Olga Robinson & Shayan Sardarizadeh BBC Verify Share Save\n\nGetty Images/SOPA Images\n\nIndia's strikes on Pakistan and Pakistan-administered Kashmir have unleashed a wave of misinformation online, with unrelated videos purporting to be from the strikes gaining millions of views. Dramatic clips debunked by BBC Verify have claimed to show attacks on an Indian army base and an Indian fighter jet shot down in Pakistan. One video, which had more than 400,000 views on X at the time of writing, claiming to show an explosion caused by a Pakistani response was actually from the 2020 Beirut Port explosion in Lebanon. An expert told BBC Verify that in moments of heightened tension or dramatic events, misinformation is more likely to spread and fuel distrust and hostility.\n\n\"It's very common to see recycled footage during any significant event, not just conflict,\" Eliot Higgins, the founder of the Bellingcat investigations website, said. \"Algorithmic engagement rewards people who post engaging content, not truthful content, and footage of conflict and disasters is particularly engaging, no matter the truth behind it.\" One of the most viral clips, which gained over 3 million views on X in a matter of hours, claimed to show blasts caused by the Indian strikes on Pakistan-administered Kashmir. A search for screengrabs from the video on Google found the footage actually showed Israeli strikes on the Gaza Strip on 13 October 2023. Follow live: Tensions escalate as Pakistan vows response to Indian strikes\n\nWhat we know about India's strike on Pakistan and Pakistan-administered Kashmir\n\nWhy India and Pakistan fight over Kashmir While much of the debunked footage has purported to show the immediate aftermath of the Indian strikes, some clips analysed by BBC Verify appeared to be trying to portray the Pakistani response as being more severe than it actually was. One video, which has racked up almost 600,000 views on X, claimed to show that the \"Pakistan army blew up the Indian Brigade headquarters\". The clip, which shows blasts in the darkness, is actually from an unrelated video circulating on YouTube as early as last month.\n\nX/Sulaiman Ahmed\n\nElsewhere, one set of photos purported to show an operation carried out by the Pakistan Air Force targeting \"Indian forward air-bases in the early hours of 6 May 2025\". The images - which appeared to be captured by a drone - were actually screengrabs taken from the video game Battlefield 3. The Pakistani military says it destroyed five jets on Wednesday morning local time. That announcement has led to some users sharing unrelated clips which they claimed showed the wreckage of Indian fighter jets. Some of these videos have obtained millions of views. But two widely shared images actually showed previous Indian air force jet crashes - one from an incident in Rajasthan in 2024 and another in the Punjab state in 2021. Both crashes were widely reported.\n\nX/Sulaiman Ahmed",
    "url": "https://www.bbc.com/news/articles/c93g3jk39dko"
  },
  {
    "title": "Latest News & Updates",
    "text": "The first drone war opens a new chapter in India-Pakistan conflict\n\nExperts say the tit-for-tat attacks mark a dangerous new phase in the decades-old rivalry. What next?",
    "url": "https://www.bbc.com/news/world/asia/india"
  },
  {
    "title": "India, Pakistan and Kashmir: What's happening?",
    "text": "India has launched a series of air attacks on sites in Pakistan and Pakistan-controlled areas in Kashmir.\n\nPakistan has responded by firing on part of Indian-controlled Kashmir.\n\nKashmir is a region that is run partly by India and partly by Pakistan, but claimed by both as part of their country.\n\nThese airstrikes follow attacks in an Indian-controlled part of Kashmir last month.\n\nIndia blamed Pakistan for these attacks, although Pakistan denies any involvement.",
    "url": "https://www.bbc.co.uk/newsround/articles/c30q0j4lrggo"
  },
  {
    "title": "Militant group chief says relatives killed in India strike",
    "text": "Militant group chief says relatives killed in India strike\n\n4 days ago Share Save Frances Mao BBC News Reporting from London Umer Draz Nangiana BBC Urdu Reporting from Bahawalpur Share Save\n\nReuters Coffins laid out at a funeral for those killed in a strike on a madrasa in Bahawalpur\n\nThe Pakistan-based leader of a militant group has said 10 of his relatives have been killed in a missile strike by India. Masood Azhar, chief of Jaish-e-Mohammed (JeM), said his older sister and her husband, his nephew and his nephew's wife, his niece and five children from his family were killed in a strike on a mosque in Bahawalpur, Pakistan. India launched strikes on sites in Pakistan and Pakistan-administered Kashmir on Tuesday night. Islamabad called the strikes a \"heinous act of aggression\". India said it acted in response to a militant attack in Indian-administered Kashmir two weeks ago that killed 25 Indians and one Nepali. Pakistan has denied involvement in the attack.\n\nIndian police alleged that two of the attackers were Pakistani nationals, with Delhi accusing Pakistan of supporting militants - a charge Islamabad denies. India said it targeted sites on Tuesday night \"from where terrorist attacks against India have been planned and directed\". Pakistan said six locations have been hit, but denies India's allegations of these being terrorist infrastructure. India said JeM's headquarters in Bahawalpur, 100km inside Pakistan, was hit. Video footage of the mosque, assessed by BBC Verify, showed one of its domes had collapsed and extensive damage occurred inside, including two holes in the roof and one in the ground. In Bahawalpur on Wednesday, crowds were mourning those killed in the strikes overnight in funeral processions through the streets. Local residents told the BBC they were angry about the attack, but also worried about Pakistan's potential response.",
    "url": "https://www.bbc.com/news/articles/cjewen7w192o"
  },
  {
    "title": "India-Pakistan air strikes",
    "text": "Kashmir: Why India and Pakistan fight over it\n\nThey fought two wars over it and are nuclear armed - but what's at the root of the dispute?",
    "url": "https://www.bbc.com/news/topics/czl084npwj2t"
  },
  {
    "title": "Villagers tell BBC they survived shelling in Indian-administered Kashmir",
    "text": "Villagers tell BBC they survived shelling in Indian-administered Kashmir\n\n3 days ago Share Save Aamir Peerzada Reporting from Indian-administered Kashmir Share Save\n\nBBC Badrudin said he was forced to flee Salamabad overnight as shells hit his village\n\nIn the village of Salamabad in Indian-administered Kashmir on Wednesday morning, ruined homes were still smouldering. This small settlement lies close to the Line of Control which separates Indian-administered and Pakistan-administered Kashmir, the scene of rapidly escalating tensions in recent weeks that led to strikes from India on sites in Pakistan and Pakistan-administered Kashmir on Tuesday night. The streets of Salamabad were almost completely empty the next morning. Locals said the village was struck by Pakistani shelling. Most of the residents had fled the bombardment, leaving chickens pecking in their cages in gardens.\n\nBashir Ahmad, a local shopkeeper who witnessed the destruction, told the BBC that around 02:00 local time (20:30 GMT), \"while we were fast asleep, a loud explosion jolted us awake. Mortar shells had landed near a water dam, and by 03:00 more shells struck several houses, setting them ablaze. The government issued no warning or advisory about the cross-border shelling, and we have no safety bunkers to take shelter in.\"\n\nBashir Ahmad was one of the few people left in Salamabad\n\nSalamabad is no stranger to this kind of shelling: until 2021, incidents of cross-border fire were reported regularly. However, a ceasefire agreement signed between the militaries of both countries saw the number of attacks sharply decrease. Life returned to normal for most, free of fear - that was, until Wednesday morning. Uncertainty now hangs over the villages scattered along the Line of Control once more. Mr Ahmad estimated that only a handful of Salamabad's 100 or so residents had remained, the rest having left in search of safety from what he described as the most intense shelling in years. In the village, two homes had been torn apart by mortars.\n\nThrough a hole in the wall of one house, some crockery had remained impossibly upright on a shelf - while everything else around lay shattered or burned. The small homes were no match for the scale of the firepower they encountered overnight. They had been entirely hollowed out by explosions and fire, their tin roofs buckled above them. At a hospital 40km away, Badrudin said he was injured in the shelling, along with this eight-year-old son and sister-in-law.",
    "url": "https://www.bbc.com/news/articles/c0l0l21x9n1o"
  },
  {
    "title": "Pahalgam: US urges India and Pakistan to defuse tensions after Kashmir attack",
    "text": "US urges India and Pakistan to defuse tensions after Kashmir killings\n\n1 May 2025 Share Save Nikita Yadav BBC News, Delhi Share Save\n\nReuters The city of Srinagar in Indian-administered Kashmir has seen heightened security since the attack\n\nThe US has urged India and Pakistan to work together to \"de-escalate tensions\" after a deadly militant attack in Indian-administered Kashmir last week killed 26 civilians. Secretary of State Marco Rubio held separate talks with India's foreign minister and Pakistan's prime minister on Wednesday and called on them to \"maintain peace and security in South Asia\". India accuses Pakistan of supporting militants behind the 22 April attack at a scenic meadow near the resort town of Pahalgam. Islamabad rejects the allegations. On Wednesday India also announced the closure of its airspace for all Pakistani aircraft, in the latest of a series of tit-for-tat measures taken by both sides.\n\nThe \"perpetrators, backers and planners\" of the Pahalgam attack \"must be brought to justice\", Indian Foreign Minister S Jaishankar wrote on X after speaking to his US counterpart by telephone, as Rubio expressed his sorrow and reaffirmed Washington's support in India's fight against terrorism. Meanwhile, the top US diplomat expressed the need to \"condemn the terror attack\" in his talks with Pakistani Prime Minister Shehbaz Sharif. He urged Islamabad to co-operate \"in investigating this unconscionable attack\". During the call, Sharif rejected \"Indian attempts to link Pakistan to the incident\", a statement issued by his office read. The Pakistani prime minister also urged the US to \"impress upon India to dial down the rhetoric and act responsibly\".\n\nPress Information Bureau, India Modi reportedly gave the Indian armed forces full freedom to respond to the attack\n\nThe phone calls come after Pakistan's information minister warned that they had \"credible intelligence\" suggesting India might launch military action against the country in the next 24-36 hours. Delhi has not publicly commented on these claims. There has been speculation over whether India will respond with military strikes against Pakistan, as it did after deadly militant attacks in 2019 and 2016. Islamabad has warned of retaliation in case of military action from India's side. Amid mounting tensions Indian Prime Minister Narendra Modi has held back-to-back meetings with senior state and defence officials in Delhi this week. On Wednesday, India's cabinet committee on security, led by Modi, met for the second time since the attack. This came a day after the prime minister, in his meeting with India's top defence officials, gave the armed forces a free hand to decide on the \"timing, targets and mode\" in their response to the Pahalgam attack, according to Indian news outlets citing unnamed sources. Troops from both sides have traded intermittent small-arms fire across the border for the past few days. On Tuesday India \"strongly objected\" to multiple ceasefire violations by Pakistan during a weekly call between senior army officials of both countries, Indian news outlets reported. A day later, India announced that it would not allow any Pakistani aircraft - commercial or military - to fly over its airspace, responding to a similar move by Pakistan. Last week, India suspended most visas given to Pakistani nationals and asked them to leave the country within days, the deadline for which has since passed. It also suspended a key water-sharing agreement with Pakistan. Islamabad further retaliated with similar visa cancellations and by suspending a 1972 peace treaty with Delhi. Since the measures were announced, 786 Pakistani citizens have left India and 1,465 Indians have returned from Pakistan, media reports say. Meanwhile, the Instagram accounts of a number of Pakistani film actors and celebrities have been blocked in India.\n\nReuters Hundreds of Pakistani nationals have left India via the Attari-Wagah border crossing",
    "url": "https://www.bbc.com/news/articles/cvgnw9kydgqo"
  },
  {
    "title": "Asim Munir: Pakistan army chief’s Kashmir remarks cause anger in India",
    "text": "Pakistan army chief's Kashmir remarks cause anger in India\n\n30 April 2025 Share Save Farhat Javed BBC Urdu, Islamabad Share Save\n\nGetty Images An effigy of Gen Asim Munir was burnt at a protest in India last week\n\nPakistan's army chief, General Asim Munir, is not known for seeking the spotlight. Yet in recent weeks, it has found him - not only in Pakistan, but across the border in India and in diplomatic capitals far beyond. His remarks on Kashmir - made just days before a militant attack in Indian-administered Kashmir which killed 26 people - have reignited a debate over Pakistan's military stance and its role in rising regional tensions. Kashmir, which India and Pakistan claim in full but administer only in part, has been a flashpoint between the countries since they were partitioned in 1947. Though not directly linked to the violence, Gen Munir's words have been dissected and interpreted as a shift towards a more confrontational tone, both from him and the institution he leads. He is viewed as the most powerful man in Pakistan, where the military has long been blamed for interfering in politics, installing and removing governments. As tensions with India rise again, he is being watched as the central figure in a volatile nuclear-armed rivalry. So who is Gen Munir? And what drives him?\n\nISPR/X As the army chief, Gen Munir is the most powerful man in Pakistan today\n\nGen Munir, who is in his late 50s, is the son of a school principal and religious scholar. He joined the army through the Officers Training School in Mangla in 1986, earning the prestigious Sword of Honour given to the best-performing cadet. He was then commissioned into the 23 Frontier Force Regiment. Over nearly four decades, Gen Munir has commanded troops along Pakistan's sensitive northern borders near Kashmir, led its intelligence services and served in Saudi Arabia to bolster defence ties. He holds a masters degree in public policy and strategic security management from the National Defence University in Islamabad and is also an alumnus of military institutions in Japan and Malaysia. I first saw Gen Munir in Islamabad in 2023, at a packed hotel hall filled with ministers, diplomats, generals and journalists. Dressed in civilian clothes, he moved with calm authority, scanning the room as he approached the podium. He opened his speech with a recitation from the Quran, reflecting his rare status as a hafiz - someone who has memorised Islam's holy book in its entirety - among Pakistan's military elite. In person, Gen Munir seemed soft-spoken and polite. On stage, he was stern, with the sharp gaze of a former spymaster. A man trained to watch, listen and wait. Now, his words are echoing beyond Pakistan. Gen Munir became Pakistan's chief of army staff in November 2022, stepping into the role amid a perfect storm of political upheaval, an economic crisis and public disillusionment with the military's role in governance. His appointment followed months of speculation, largely because of his fallout with the then-prime minister Imran Khan. Gen Munir had served just eight months as the chief of Pakistan's Inter-Services Intelligence (ISI) spy agency before being removed by Khan in what many believe was a deeply personal and political move - though both sides deny this. That moment remains a turning point in their relationship. Today, Khan is serving a sentence in jail and Gen Munir is the most powerful man in the country. Gen Munir is regarded by many commentators as differing in temperament and approach from his immediate predecessor, Qamar Javed Bajwa. Gen Bajwa was more public-facing, supported backchannel diplomacy with India and handled a major escalation of tensions between the countries in 2019 with caution. Under what came to be known as the \"Bajwa Doctrine\", he increasingly emphasised regional stability and geo-economics alongside traditional security priorities. After a suicide bomb attack on troops in Indian-administered Kashmir at Pulwama in 2019, Gen Bajwa oversaw Pakistan's military response to Indian air raids but refrained from escalation, returning Indian pilot Abhinandan Varthaman and helping avert a full-blown war. \"Bajwa was clear,\" says Abdul Basit, senior fellow at Singapore's S Rajaratnam School of International Studies. \"He had diplomatic channels open and was managing multiple fronts like Kashmir, Afghanistan and the US withdrawal from Afghanistan with pragmatism,\" he said, adding that Gen Munir \"is under immediate, intense pressure to act\". \"He has come in with unfinished business to stabilise the country's security situation internally… The problems he faces (rising terrorism, political instability, an economic crisis, regional tensions) are urgent and worsening. He cannot afford long, drawn-out strategies like his predecessor Bajwa could. He needs quicker, firmer responses - both at home and abroad.\"\n\nReuters Chairs and tables are seen scattered at the site of the Pahalgam attack\n\nThe dispute over Kashmir is an issue that no Pakistani military leader can appear weak on, observers say. \"Kashmir is Pakistan's national security interest - every child in Pakistani schools is taught this,\" political and defence analyst Amir Zia told the BBC, adding: \"It's a basic understanding here that we cannot give India any leverage.\" Last week's attack was the deadliest on civilians in Indian-administered Kashmir in two decades and led to India accusing Pakistan of supporting the attackers, charges Islamabad denies. There are fears India will respond with military action. Since he took over, Gen Munir has mostly not spoken in public, but one pivotal speech has gained widespread attention. On 17 April, he told a meeting of expatriates in Islamabad \"we are different from Hindus\" in every possible way. He doubled down on Kashmir, calling it Pakistan's \"jugular vein\", and vowed Pakistan would \"never abandon Kashmiris in their heroic struggle against Indian occupation\". The speech might have remained one of many ideological statements made by Pakistani leaders over the years except for what happened next. Just five days later, on 22 April, militants opened fire on tourists in Pahalgam in Indian-administered Kashmir. \"This was not standard rhetoric,\" says Joshua T White, a South Asia expert at Johns Hopkins University. \"While the substance aligns with Pakistan's ideological narrative, the tone - especially its direct invocation of Hindu-Muslim differences - made it particularly inflammatory.\" \"Coming just before the Pahalgam attack, it has badly complicated any effort by Pakistan to claim restraint or pursue backchannel diplomacy,\" he adds. Mr Basit agrees the optics were damaging: \"He [Munir] may have been caught up in the moment. He said things that, in a private setting, may not have raised eyebrows but on that public platform, as army chief, they came across as overtly confrontational.\" \"Some saw it as a power move,\" says Mr Basit. \"It felt like his arrival moment. A declaration that he's now firmly in control, that Pakistan's direction is once again in the army's hands,\" he adds. Gen Munir made another speech earlier in the year, which some think may signal he is adopting a harder line than his predecessor. Speaking in Muzaffarabad on Kashmir Solidarity Day on 5 February, he declared: \"Pakistan has already fought three wars for Kashmir, and if 10 more wars are required, Pakistan will fight them.\" But given the timing, it's his latest speech that has fuelled speculation after the Pahalgam attack, with Indian officials hinting at a link. Though no evidence has been presented so far, the rhetoric has deepened mistrust.\n\nGetty Images Indian security officials stand guard near Dal lake in Srinagar",
    "url": "https://www.bbc.com/news/articles/c39j3p14mg4o"
  },
  {
    "title": "Pahalgam attack: How will India respond to the Kashmir killings",
    "text": "Deadly Kashmir attack risks India military escalation against Pakistan\n\nTuesday's bloodshed in Pahalgam - where at least 26 tourists were killed in a hail of gunfire - marks the deadliest militant attack in Indian-administered Kashmir since 2019.\n\nThe victims weren't soldiers or officials, but civilians on holiday in one of India's most picturesque valleys. That alone makes this strike both brutal and symbolic: a calculated assault not just on lives, but on a fragile sense of normalcy the Indian state has worked hard to project in the disputed region.\n\nGiven the fraught history of Kashmir - claimed in full by both India and Pakistan but ruled by each only in part - India's response is likely to be shaped as much by precedent as by pressure, say experts.\n\nFor starters, Delhi has swiftly taken a series of retaliatory steps: closing the main border crossing, suspending a critical water-sharing treaty, and expelling diplomats.\n\nMore significantly, Defence Minister Rajnath Singh has vowed a \"strong response,\" pledging action not just against the perpetrators but also the masterminds behind the \"nefarious acts\" on Indian soil.\n\nThe question, analysts say, is not whether there will be a military response - but when, and how calibrated it will be, and at what cost.\n\n\"We are likely to see a strong response – one that signals resolve to both domestic audiences and actors in Pakistan. Since 2016 and especially after 2019, the threshold for retaliation has been set at cross-border or air strikes,\" military historian Srinath Raghavan told the BBC.\n\n\"It'll be hard for the government to act below that now. Pakistan will likely respond, as it did before. The risk, as always, is miscalculation – on both sides.\"\n\nMr Raghavan is alluding to two previous major retaliations by India in 2016 and 2019.\n\nAfter the deadly Uri attack in September 2016, where 19 Indian soldiers were killed, India launched what it called \"surgical strikes\" across the de facto border - also known as the Line of Control (LoC) - targeting what it said were militant launch pads in Pakistan-administered Kashmir.\n\nAnd in 2019, after at least 40 paramilitary personnel were killed in Pulwama, India hit an alleged militant camp in Balakot with airstrikes - its first such strike deep inside Pakistan since 1971. Pakistan responded with air raids, leading to a dogfight and the brief capture of an Indian pilot. Both sides showed strength but avoided full-scale war.\n\nTwo years later, in 2021, they agreed to an LoC ceasefire, which has largely held - despite recurring militant attacks in Indian-administered Kashmir.\n\nMichael Kugelman, a foreign policy analyst, believes that the combination of high fatality levels and the targeting of Indian civilians in the latest attack \"suggests a strong possibility of an Indian military response against Pakistan, if Delhi determines or merely assumes any level of Pakistani complicity\".",
    "url": "https://www.bbc.com/news/articles/cwynx7kgyqvo"
  },
  {
    "title": "India closes main border crossing with Pakistan after Kashmir attack",
    "text": "India closes main border crossing with Pakistan after Kashmir attack\n\nWatch: First responders on the scene after gunman opens fire on tourists at Pahalgam\n\nThe attack in Pahalgam was one of the deadliest in recent memory for the restive region - and is threatening to aggravate already icy bilateral ties.\n\nPakistani officials, who have denied the country's role in the attack, are meeting on Thursday to come up with a response, its foreign minister said.\n\nThey include the closure of the main border crossing linking the two countries, the suspension of a landmark water-sharing treaty, the expulsion of diplomats and an order for some Pakistani visa holders to leave within 48 hours.\n\nIndia has announced measures targeting Pakistan, a day after 26 people were killed by gunmen at a Himalayan tourist attraction in Indian-administered Kashmir .\n\nIndia and Pakistan both claim Kashmir in full but control it only in parts. Since India's partition and the creation of Pakistan in 1947, the nuclear-armed neighbours have fought wars over the territory.\n\nThe Indian government has responded furiously to the attack and has signalled it holds Pakistan indirectly responsible. India has long accused successive governments in Islamabad of supporting armed groups in the region, which Pakistan strongly denies.\n\n\"Those behind this heinous act will be brought to justice,\" Indian Prime Minister Narendra Modi said in a post on X. \"Our resolve to fight terrorism is unshakable and it will get even stronger.\"\n\nIndia also said it would suspend the Indus Water Treaty - a treaty that has been in place since 1960 and survived decades of hostile diplomacy.\n\nThe treaty gives India control over the eastern rivers, and Pakistan the western ones, of the Indus river and its tributaries. The agreement stipulates that India must, with few exceptions, allow water from the western rivers to flow downstream into Pakistan.\n\nIndian security agencies believe a group called the Kashmir Resistance was behind the attack, though BBC News has not independently verified that.\n\nA manhunt for the gunmen responsible was continuing on Wednesday evening.\n\nPakistan's government said its National Security Council - the country's highest military and security body - would meet on Thursday.\n\nIn the aftermath of the Pahalgam attack, the Pakistani foreign ministry said it was \"concerned at the loss of tourists' lives\" and expressed condolences.\n\nUnder the measures announced by India on Wednesday, Pakistani military advisers based at the Delhi embassy were told to leave immediately, and more diplomatic expulsions are planned for next week, a statement said.\n\nThe Pahalgam attack risks reigniting long-running tensions between the nuclear-armed rivals.\n\nEarlier, Defence Minister Rajnath Singh also signalled India's response would go beyond targeting the perpetrators.\n\nHe said: \"We will not only reach those who have perpetrated this incident but also those who, sitting behind the scenes, have conspired to commit such acts on the soil of India.\"\n\nThe attack has been widely condemned by international leaders and has generated outrage and mourning in India.\n\nEyewitnesses have described chaotic and bloody scenes as holidaymakers including entire families fled for their lives.\n\nSome witnesses said it appeared the gunmen targeted non-Muslims but others have described the shooting as random.\n\nMost of the victims were Hindu men, though a local Muslim man was among the victims.\n\n\"We cannot get over the fact that such an incident has occurred, and that too in the place we call heaven on earth,\" Akib Chaya, a hotel owner and a member of the Kashmir Chamber of Commerce, told BBC's Newshour.\n\n\"Tourists have been coming to Kashmir since the last three or four decades and they have never been touched.\"\n\nIndia's government has not given an official account on whether people were targeted on the basis of religion.",
    "url": "https://www.bbc.com/news/articles/ce8g2njm2d2o"
  },
  {
    "title": "Pakistan",
    "text": "Why are there so many parakeets in Surrey?\n\nFrom Jimi Hendrix to 1950s films, many myths surround how the birds ended up in the county.",
    "url": "https://www.bbc.com/news/topics/c008ql15vpyt"
  },
  {
    "title": "Pahalgam attack: Families separated at India-Pakistan border",
    "text": "'What is our fault?': Families separated at India-Pakistan border\n\n30 April 2025 Share Save Zoya Mateen BBC News, Delhi Harmandeep Singh and Gurpreet Chawla BBC Punjabi Share Save\n\nBBC Punjabi Pakistani citizen Shahida Adrees moved to India decades ago - now she fears she can't go back home to see her siblings\n\nShahida's face crumpled with grief every time she thought about the choice in front of her: Stay for love or go back to her siblings? Shahida Adrees, now 61, moved to India from Pakistan in 2002, when she married her maternal cousin Adrees Khan, a resident of Punjab state (marriage between cousins is practised in some communities in South Asia). The couple lived a peaceful, predictable life - Khan working as a driver and Shahida looking after their home and child. Every few years, Shahida, who is staying in India on a long-term visa, would obtain a travel permit and make a trip to Pakistan to meet her family. But that sense of routine was shattered last week when India suspended almost all visas for Pakistani citizens as part of its response to the brutal attack in Indian-administered Kashmir that killed 26 people. Pakistan, which denies any involvement, has hit back with tit-for-tat measures and also cancelled most visas for Indians. When Shahida heard the news, she knew what it meant; she could either go back to her siblings and other family members in Pakistan now, or stay and risk never seeing them again. She chose to stay. Earlier this week, she cancelled her plans of going to Pakistan to see an ailing aunt. \"If I had gone, I wouldn't have been let back into India. But now that I am here, I don't know if I'll ever see my brothers and sisters again,\" she says.\n\nGetty Images Several families have been separated after India and Pakistan suspended almost all visas\n\nShahida's family is among hundreds in India and Pakistan who, with members on both sides of the borders, now face the risk of separation. Despite neighbours India and Pakistan sharing a hostile relationship, love stories and marriages between its citizens are not uncommon. That's because of the deeply intertwined cultural history of the countries which were partitioned along religious lines in 1947, forcing millions to leave their homes and migrate to the other side. The border between the nations runs not just through the ground, but also through families - many Indians have relatives and their hometowns in Pakistan, and vice versa. Some, like Shahida's family, have tried to stay in touch with their roots through marriages with relatives across the border. In recent years, many couples have also met online, often overcoming insurmountable odds to stay together. Many of them apply for long-term visas that need to be renewed periodically while others apply for citizenship of the respective countries - but the process can take years. This week, as the visa restrictions took effect, heart-breaking visuals of people - young and old couples, desperate sons and daughters, and elderly parents - pleading with authorities for help were splashed across television screens and on social media. The BBC has contacted the Indian foreign ministry for comment. \"I came here with my mother. Now they are asking us to leave without her. How can I do that?\" mumbled a tearful Mohammed Ayat, 17. A Pakistani national, Ayat came to India last month to meet his maternal relatives. His mother is an Indian citizen who was living in Pakistan on a visa that is pending renewal. But even as her children returned to Pakistan, she had to stay in India as she wasn't sure whether she would be allowed into the country. \"They can punish them [the militants], but what is our fault?\" Ayat told ANI news agency.\n\nANI Ayat, a Pakistani national, came to India to meet his mother's relatives\n\nThe exact number of people leaving both countries due to the latest tensions is not clear - but is estimated to run into hundreds. Sitting in a bus that was taking her to the Attari-Wagah border, Parveen (who uses only one name), told reporters that she had lived in India for 41 years. \"I have no mother, brothers or sisters in Pakistan. I have nowhere to go there. I am completely helpless,\" she said. Families say the abruptness of the visa suspensions and the resulting chaos have left them feeling uncertain. The restrictions imposed by Delhi exempt those like Shahida, who have been living in India on a long-term visa which needs to be renewed every few years. Valid for up to five years, these visas are given to women of Pakistani and Bangladeshi nationalities who are married to Indian citizens. Under Indian rules, all long-term visa holders are allowed to visit their home country after obtaining a second permit, called the No Objection to Return to India (NORI) visa. But in the days following the attack, there have been reports of NORI visa holders also being stopped from crossing the border into India, as officials waited for clarity. Shahida says that in her case, Indian authorities have assured her that NORI visa-holders would be exempted from the restrictions. But she is not willing to take the risk of leaving India. She wondered if things would've been better if she had got an Indian citizenship. \"I did apply for it in 2009, but the file never moved. I never received a response,\" she said. For Tahira Ahmed, even becoming an Indian citizen has not been enough to allay her anxieties. A Pakistani by birth, Ms Ahmed moved to Punjab state in 2003 after marrying Maqbool Ahmed, an Indian . In 2016, Tahira was granted Indian citizenship, 13 years after her marriage. But she is still fearful about the prospect of being separated from her family and sent to Pakistan.\n\nReuters Twenty-six people were killed after militants opened fire at a group of people in Pahalgam last week",
    "url": "https://www.bbc.com/news/articles/cgjlxxd5vvjo"
  },
  {
    "title": "Kashmir profile",
    "text": "When India and Pakistan gained independence from British rule in 1947, the various princely rulers were able to choose which state to join.\n\nThe Maharaja of Kashmir, Hari Singh, was the Hindu head of a majority Muslim state sandwiched between the two countries and could not decide. He signed an interim \"standstill\" agreement to maintain transport and other services with Pakistan.\n\nIn October 1947 tribesmen from Pakistan invaded Kashmir, spurred by reports of attacks on Muslims and frustrated by Hari Singh's delaying tactics. The Maharaja asked for Indian military assistance.\n\nIndia's governor-general, Lord Mountbatten, believed peace would best be served by Kashmir's joining India on a temporary basis, pending a vote on its ultimate status. Hari Singh signed the Instrument of Accession that month, ceding control over foreign and defence policy to India.\n\nIndian troops took two-thirds of the territory, and Pakistan seized the northern remainder. China occupied eastern parts of the state in the 1950s.\n\nWhether the Instrument of Accession or the entry of Indian troops came first remains a major source of dispute between India and Pakistan. India insists that Hari Singh signed first, thereby legitimising the presence of their troops. Pakistan is adamant that the Maharaja could not have signed before the troops arrived, and that he and India had therefore ignored the \"standstill\" agreement with Pakistan.\n\nPakistan demands a referendum to decide the status of Kashmir, while Delhi argues that, by voting in successive Indian state and national elections, Kashmiris have confirmed their accession to India. Pakistan cites numerous UN resolutions in favour of a UN-run referendum, while India says the Simla Agreement of 1972 binds the two countries to solve the problem on a state-to-state basis.\n\nThere has been no significant movement from these positions in decades. In addition, some Kashmiris seek a third option - independence - which neither India nor Pakistan is prepared to contemplate.\n\nThe two countries fought wars over Kashmir in 1947-48 and 1965. They formalised the original ceasefire line as the Line of Control in the Simla Agreement, but this did not prevent further clashes in 1999 on the Siachen Glacier, which is beyond the Line of Control. India and Pakistan came close to war again in 2002.\n\nThe situation was further complicated by an Islamist-led insurgency that broke out in 1989. India gave the army additional authority to end the insurgency under the controversial Armed Forces Special Powers Act (AFSPA). Despite occasional reviews of the AFSPA, it still remains in force in Indian-administered Jammu and Kashmir.",
    "url": "https://www.bbc.com/news/world-south-asia-11693674"
  }
]