[
  {
    "title": "Rihanna – Work Lyrics",
    "text": "That one came about by just having a conversation with a few producers that I work with, Allen Ritter and Sevn Thomas. We were talking about the vibe from back in the day, how dancehall music used to make people feel and make the girls dance. Everybody wanted to dance when dancehall music came on. Being in this era of trap-dominated music, I was like, ‘Let’s make something that’s a little outside the box and makes you want to dance and be happy, and makes the women want to turn up.’\n\nThat was really the idea when we were creating the track. That was the vibe. We were just having fun in the studio. We didn’t even care if it had anything to do with what’s going on right now; we were just doing something that we thought was cool for ourselves.\n\nI wasn’t in the studio with PARTY[NEXTDOOR]. He was actually working with Rihanna. I was just at home, I wasn’t able to make it through so I sent them a bunch of tracks and she ended up picking two. They wrote two together—there was ‘Work’ and ‘Sex With Me,’ which was on the album [Anti]. I wasn’t there for the whole process of them putting the song together, but PARTY kept me updated.\n\n[‘Sail Away’] was one of my favorite riddims coming up. I was born in Jamaica and I grew up on dancehall music. My dad would play only dancehall in the house. I really wanted to bring back the feel of how I felt when I heard that riddim, you know? I took a little sample from that and replayed the melody and worked it amazing.\n\n[The proliferation of dancehall in pop music] doesn’t bother me. I mean, it did before, but when you make music and you make the style, you do something innovative, people are just going to do it. You could get angry about it but I prefer to just move on and do something else.\n\n[‘Work’’s success] was a great feeling. It’s always a great feeling because you just never know. Music changes so quick. It could be one day where the music you’re making isn’t connecting anymore. So to know that my music and my production is still appreciated, it’s always a great feeling. It’s really what I do it for: respect. I just love when people love my music. A lot of people do it for other reasons, and obviously, music can change your life and feed your family. But for me, it all started with making good music.",
    "url": "https://genius.com/Rihanna-work-lyrics"
  },
  {
    "title": "Drake – In My Feelings",
    "text": "“In My Feelings” is an upbeat, club-mixed love letter to “Kiki,” “KB,” and the members of City Girls. The track rides on Drake’s heartfelt singing and honest lyrics, wondering if they still love him.\n\nThe track is produced by 40, TrapMoneyBenny and BlaqNmilD. BlaqNmilD had a hand at producing another track on Scorpion, “Nice for What,” which has similar New Orleans bounce influences.\n\nThe track is heavily based on vocal samples, a staple of New Orleans bounce. One included sample is Magnolia Shorty’s “Smoking Gun,” and City Girls' vocals are written to sound similar to that track. Also sampled is Lil Wayne’s “Lollipop.”\n\nAt the end of the song, Drake samples the seventh episode of the second season of popular TV show Atlanta, which is written, directed, and acted in by Donald Glover a.k.a Childish Gambino. This episode revolved around Drake and was aptly titled “Champagne Papi,” his Instagram username and producer alter-ego.\n\nDays following the album’s release, “In My Feelings” garnered widespread media attention due to a viral video of comedian and Instagram personality, Shiggy, dancing to the song’s hook. The video evolved into the #DoTheShiggy challenge where people would try to replicate Shiggy’s original video. The challenge contributed to “In My Feelings” topping the Billboard Hot 100.\n\nThe music video for “In My Feelings” was released on August 2, 2018, starring Drake, Phylicia Rashad, La La Anthony, Shiggy, and Capito & Marley.",
    "url": "https://genius.com/Drake-in-my-feelings-lyrics"
  },
  {
    "title": "Drake – God's Plan",
    "text": "“God’s Plan” is a feel-good track that discusses Drake’s future. Being who he is in the industry, he knows that people want him to fail; however, God won’t let him do that.\n\nAnother key subject of the song is the separation Drake feels that he needs to have from those outside of his inner circle. Anyone who tries to work their way into his life must have an ulterior motive to benefit themselves.\n\nThe last key subject of this song is the fact that Drake is giving back to the life he had once, honoring the people and the environment he also once was in.\n\nThe official music video shared a different sentiment though, as Drake took the budget for the video, a whopping $996,631.90, and gave it away to families, schools, charities, and more. It was directed by Karena Evans, who also hails from Toronto, and is a protégé of Director X.\n\nDirector X has had a hand in a number of Drake music videos in the past, including “Hotline Bling” and “Started From The Bottom.”",
    "url": "https://genius.com/Drake-gods-plan-lyrics"
  },
  {
    "title": "Drake – Hotline Bling",
    "text": "“Hotline Bling” is most likely about Drake’s old flame from Toronto, Nebby. She’s had an on and off relationship with the 6 God a few times, and her Instagram account is a constant reminder that she’s never home – always traveling to exotic places, and out wearing almost nothing. Based on the lyrics, it’s as if Drake wrote this song while scrolling through her Instagram page.\n\nThis song premiered alongside “Charged Up,” “Right Hand,” and material from other OVO artists on OVO Sound Radio Episode 2.\n\nIt reached #2 on the Billboard Hot 100, becoming Drake’s then highest peaking single as a lead artist, only to be replaced by the Views single “One Dance” which peaked at #1.\n\nThe song heavily samples the song “Why Can’t We Live Together” by Timmy Thomas and has been remixed/covered by a seemingly ever-growing number of Drake’s peers, including Justin Bieber, Erykah Badu, Disclosure/Sam Smith, and Sufjan Stevens.\n\nThe official music video was released on October 19th via Apple Music, and was immediately made into a source of various memes involving Drake’s dancing. The song and choreography received much attention that Drake got to perform a segment of the infamous dance in a T-Mobile commercial that aired during Super Bowl 50.",
    "url": "https://genius.com/Drake-hotline-bling-lyrics"
  },
  {
    "title": "Travis Scott – HIGHEST IN THE ROOM Lyrics",
    "text": "On “HIGHEST IN THE ROOM,” Travis discusses his relationship with his then-wife and mother of his child – Kylie Jenner – and his self-proclaimed title as the most intoxicated person in the place he is in.\n\nThis song was first teased by Kylie on April 22, 2019, when it played in an advertisement for her Kybrows cosmetic product. Following this, on May 3, 2019, Travis performed a portion of the song during his headlining set at JMBLYA 2019, and then again a week later, during his set at Rolling Loud Miami.\n\nIn late June 2019, Travis performed a large portion of the track, during his Morocco performance and on August 31, 2019, he previewed Lil Baby’s verse during a live show.\n\nOn September 30, 2019, Travis revealed the single’s final release date and cover art in an Instagram post. Coincidentally, two days before the scheduled release of “HIGHEST IN THE ROOM” Travis and Kylie reportedly called it quits on their relationship.\n\nThe song was officially released on October 4, 2019, along with accompanying visuals. However, the final version did not include the teased Lil Baby feature. It eventually was released on the song’s remix in December of 2019.\n\nThe track also became Scott’s second single to top the Billboard Hot 100 chart, and first to debut in the peak position. “HIGHEST IN THE ROOM” was certified 4x Multi-Platinum by RIAA on December 1, 2020.",
    "url": "https://genius.com/Travis-scott-highest-in-the-room-lyrics"
  },
  {
    "title": "Travis Scott – STARGAZING Lyrics",
    "text": "“STARGAZING” is a song describing the experience of an unpredictable psychedelic trip. Travis Scott’s delivery switches between his regular cadence and an auto-tuned falsetto.\n\nThe song was first previewed on his Snapchat on April 13, 2018, and has since been performed multiple times live.\n\nTravis released ASTROWORLD’s trailer four days before the album’s release, which featured the song playing over cinematic scenes of Travis Scott navigating a post-apocalyptic landscape with outer space elements.\n\nThe song title could be a reference to Houston’s iconic ties to astrological exploration, with NASA’s Mission Control Center being located in Travis’s hometown.\n\nThis track as well as “SICKO MODE,” can both be found in the NBA 2K19 Soundtrack",
    "url": "https://genius.com/Travis-scott-stargazing-lyrics"
  },
  {
    "title": "Travis Scott – 90210 Lyrics",
    "text": "Ooh, he might pop him a pill, pop him a seal Pop anyone, pop anything Pop anything to find that alley Mhm, yeah, to find that alley (Mhm)\n\nFifty on a chain, 'nother fifty on a Caddy\n\nJacques turned La Flame, now he rollin' on an Addy\n\nBaby's hooked on feeling low-ow Do, do, do Do, do\n\nOoh, used to take the long way home Long way home, all for that candy\n\n( I hope it was wet like my jumper, though )\n\nWho left her hometown world all for that alley Ooh, created Lake Tahoe all from her panties\n\nShe a porn star girl, ah, from the valley\n\nMama's mailin' out that blow, cravin' 9021—\n\nYou might also like\n\nGet tickets as low as $49\n\n( All, all, all thang, thang ) ( All, all, all thang, thang )\n\n( All, all, all thang, thang ) ( All, all, all thang, thang )\n\n( Do, do, do ) ( Do, do )\n\nOoh, in the 90210, 90210, somewhere in that alley\n\nIn the 90210, 90210, lookin' for that alley In the 90210, 90210, lookin' for that alley, ooh It's the superstar girl, superstar girl, roamin' in that alley\n\nBaby's hooked on feeling low-ow Do, do, do Do, do\n\n[Verse: Travis Scott]\n\nMy granny called, she said, \"Travvy, you work too hard\n\nI'm worried you forget about me\"\n\n(All, all, all)\n\nI'm fallin' in and out of clouds\n\nDon't worry, I'ma get it, Granny, uh\n\nWhat happened? Now my daddy happy\n\nMama called me up, that money comin' and she love me\n\n(All, all, all thang, thang)\n\nI done made it now, I done found life's meanin' now\n\n(All, all, all thang, thang)\n\nAll them days her heart'd break, her heart not in pieces now\n\nFriends turnin' into fraud niggas\n\nPracticin' half the passion, you niggas packaged different\n\n(All, all, all thang, thang)\n\nAll you niggas, you niggas want the swag, you can't have it\n\n(All, all, all thang, thang)\n\nI'ma sell it, your niggas salary, we 'bout to cap, bitch\n\nYoungest nigga out of Houston at the Grammys\n\nSmilin' at 'em laughin' at me\n\nI passed the rock to Ye, he pump faked, then passed it back, bitch\n\n(All, all, all thang, thang)\n\nAll of this off of rappin', should've wrote this in Latin, yeah-yeah\n\n(All, all, all thang, thang)\n\nCuzzo said we hit the store, yeah, we 'bout to drop a four\n\nHe passed the cigarette, I choke, woo\n\nTold my auntie, \"Put them 'Ports down, them 'Ports down\"\n\nHit the stage, they got their hands up, don't put your nose down\n\nI ain't knockin', nigga, I knocked the door down, for sure now\n\nGold chains, gold rings, I got an island on me\n\nHouses on me, he got them ounces on him\n\nHoly Father, come save these niggas, I'm stylin' on 'em\n\nGood Lord, I see my good fortune in all these horses\n\nI'm drivin' too fast to stop, so all these signs, I ignore them\n\nJust this guy from north of the border, my chips is in order\n\nMy mom's biggest supporter, so now a nigga support a nigga\n\nMmm, I know, I know, I know, I know, I knowI know, I know, I know, I know, I knowNow you know you love your own nowWhole crew, I swear they countin' on me",
    "url": "https://genius.com/Travis-scott-90210-lyrics"
  }
]